{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "absolute-refrigerator",
   "metadata": {},
   "source": [
    "# Python libraries and function definitions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "interested-timing",
   "metadata": {},
   "outputs": [],
   "source": [
    "import rdflib\n",
    "from wikidataintegrator import wdi_core, wdi_login\n",
    "from getpass import getpass\n",
    "import pandas as pd\n",
    "import sys\n",
    "import traceback\n",
    "\n",
    "def createProperty(login=login, wdprop=None, lulabel=\"\", enlabel=\"\", frlabel=\"\", delabel=\"\", description=\"\", property_datatype=\"\"):\n",
    "    if wdprop== None:\n",
    "        s = []\n",
    "    else:\n",
    "        s = [wdi_core.WDUrl(wdprop, prop_nr=\"P1\")]\n",
    "    localEntityEngine = wdi_core.WDItemEngine.wikibase_item_engine_factory(api,sparql)\n",
    "    item = localEntityEngine(data=s)\n",
    "    #item.set_label(lulabel, lang=\"lu\")\n",
    "    item.set_label(enlabel, lang=\"en\")\n",
    "    item.set_label(delabel, lang=\"de\")\n",
    "    item.set_label(frlabel, lang=\"fr\")\n",
    "    item.set_description(description, lang=\"en\")\n",
    "    \n",
    "    print(item.write(login, entity_type=\"property\", property_datatype=property_datatype))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "loving-determination",
   "metadata": {},
   "source": [
    "# Import CIDOC-CRM definition\n",
    "TODO: confirm that versions are same between DMSAF and the CIDOC-CRM definitions here"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "assured-weekly",
   "metadata": {},
   "outputs": [],
   "source": [
    "cidoc = rdflib.Graph()\n",
    "cidoc.load(\"https://raw.githubusercontent.com/erlangen-crm/ecrm/master/ecrm_current.owl\", format=\"xml\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "noticed-accent",
   "metadata": {},
   "source": [
    "# Access details for the Wikibase which host the SAF"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "acoustic-inspection",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "········\n"
     ]
    }
   ],
   "source": [
    "wbstack = \"luxsafjun171\"\n",
    "wikibase = \"https://{}.wiki.opencura.com/\".format(wbstack)\n",
    "api = \"https://{}.wiki.opencura.com/w/api.php\".format(wbstack)\n",
    "sparql = \"https://{}.wiki.opencura.com/query/sparql\".format(wbstack)\n",
    "entityUri = wikibase.replace(\"https:\", \"http:\")+\"entity/\"\n",
    "\n",
    "WBUSER = \"Andrawaag\"\n",
    "WBPASS = getpass()\n",
    "login = wdi_login.WDLogin(WBUSER, WBPASS, mediawiki_api_url=api)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "given-thompson",
   "metadata": {},
   "source": [
    "# predefined properties from rdfs, skos, etc\n",
    " TODO work on multilangauge descriptions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "automated-wholesale",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/usr/local/lib/python3.9/site-packages/wikidataintegrator/wdi_core.py:485: UserWarning: Warning: No distinct value properties found\n",
      "Please set P2302 and Q21502410 in your wikibase or set `core_props` manually.\n",
      "Continuing with no core_props\n",
      "  warnings.warn(\"Warning: No distinct value properties found\\n\" +\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "P1\n"
     ]
    }
   ],
   "source": [
    "# instance of\n",
    "createProperty(login, lulabel=\"\", \n",
    "                      enlabel=\"instance of\",\n",
    "                      frlabel=\"instance de\",\n",
    "                      delabel=\"ist ein(e)\",\n",
    "                      property_datatype=\"wikibase-item\")\n",
    "\n",
    "# subclass of\n",
    "## TODO work on multilangauge descriptions \n",
    "## \n",
    "createProperty(login, lulabel=\"Ënnerklass vu(n)\", \n",
    "                      enlabel=\"subclass of\",\n",
    "                      frlabel=\"sous-classe de\",\n",
    "                      delabel=\"Unterklasse von\",\n",
    "                      property_datatype=\"wikibase-item\")\n",
    "# skos:exact match\n",
    "createProperty(login, lulabel=\"Ënnerklass vu(n)\", \n",
    "                      enlabel=\"exact match\",\n",
    "                      frlabel=\"correspondance exacte\",\n",
    "                      delabel=\"exakte Übereinstimmung\",\n",
    "                      description=\"mapping\",\n",
    "                      property_datatype=\"url\")\n",
    "#domain \n",
    "createProperty(login, lulabel=\"\", \n",
    "                      enlabel=\"domain\",\n",
    "                      frlabel=\"domaine\",\n",
    "                      delabel=\"domain\",\n",
    "                      property_datatype=\"wikibase-item\")\n",
    "#range\n",
    "createProperty(login, lulabel=\"\", \n",
    "                      enlabel=\"range\",\n",
    "                      frlabel=\"intervalle\",\n",
    "                      delabel=\"reichweite\",\n",
    "                      property_datatype=\"wikibase-item\")\n",
    "#subPropertyOf\n",
    "createProperty(login, lulabel=\"\", \n",
    "                      enlabel=\"subproperty of\",\n",
    "                      frlabel=\"sous-propriété de\",\n",
    "                      delabel=\"untereigenschaft von\",\n",
    "                      property_datatype=\"wikibase-item\")\n",
    "#inverseOf\n",
    "createProperty(login, lulabel=\"\", \n",
    "                      enlabel=\"inverse of\",\n",
    "                      frlabel=\"inverse de\",\n",
    "                      delabel=\"invers von\",\n",
    "                      property_datatype=\"wikibase-item\")\n",
    "propertyID = dict()\n",
    "query = \"\"\"SELECT ?prop ?propLabel WHERE {\n",
    "  ?prop wikibase:directClaim ?wdt .\n",
    "  SERVICE wikibase:label { bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }\n",
    "}\"\"\"\n",
    "for index, row in wdi_core.WDItemEngine.execute_sparql_query(query, as_dataframe = True, endpoint=sparql).iterrows():\n",
    "    print(row[\"prop\"].replace(entityUri, \"\"), row[\"propLabel\"])\n",
    "    propertyID[row[\"propLabel\"]] = row[\"prop\"].replace(entityUri, \"\")\n",
    "\n",
    "# class item\n",
    "localEntityEngine = wdi_core.WDItemEngine.wikibase_item_engine_factory(api,sparql)\n",
    "item = localEntityEngine(new_item=True)\n",
    "item.set_label(\"Class\", lang=\"en\")\n",
    "item.set_aliases([\"Owl:Class\"], lang=\"en\")\n",
    "item.write(login)\n",
    "\n",
    "# property item\n",
    "localEntityEngine = wdi_core.WDItemEngine.wikibase_item_engine_factory(api,sparql)\n",
    "item = localEntityEngine(new_item=True)\n",
    "item.set_label(\"Property\", lang=\"en\")\n",
    "item.set_aliases([\"owl:ObjectProperty\"], lang=\"en\")\n",
    "item.write(login)\n",
    "propertyID"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "pleasant-noise",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "P1 instance of\n",
      "P2 subclass of\n",
      "P3 exact match\n",
      "P4 domain\n",
      "P5 range\n",
      "P6 subproperty of\n",
      "P7 inverse of\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'instance of': 'P1',\n",
       " 'subclass of': 'P2',\n",
       " 'exact match': 'P3',\n",
       " 'domain': 'P4',\n",
       " 'range': 'P5',\n",
       " 'subproperty of': 'P6',\n",
       " 'inverse of': 'P7'}"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "coated-johnston",
   "metadata": {},
   "source": [
    "# Create CIDOC-CRM items on WB SAF"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "considered-healing",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Q3\n",
      "Q4\n",
      "Q5\n",
      "Q6\n",
      "Q7\n",
      "Q8\n",
      "Q9\n",
      "Q10\n",
      "Q11\n",
      "Q12\n",
      "Q13\n",
      "Q14\n",
      "Q15\n",
      "Q16\n",
      "Q17\n",
      "Q18\n",
      "Q19\n",
      "Q20\n",
      "Q21\n",
      "Q22\n",
      "Q23\n",
      "Q24\n",
      "Q25\n",
      "Q26\n",
      "Q27\n",
      "Q28\n",
      "Q29\n",
      "Q30\n",
      "Q31\n",
      "Q32\n",
      "Q33\n",
      "Q34\n",
      "Q35\n",
      "Q36\n",
      "Q37\n",
      "Q38\n",
      "Q39\n",
      "Q40\n",
      "Q41\n",
      "Q42\n",
      "Q43\n",
      "Q44\n",
      "Q45\n",
      "Q46\n",
      "Q47\n",
      "Q48\n",
      "Q49\n",
      "Q50\n",
      "Q51\n",
      "Q52\n",
      "Q53\n",
      "Q54\n",
      "Q55\n",
      "Q56\n",
      "Q57\n",
      "Q58\n",
      "Q59\n",
      "Q60\n",
      "Q61\n",
      "Q62\n",
      "Q63\n",
      "Q64\n",
      "Q65\n",
      "Q66\n",
      "Q67\n",
      "Q68\n",
      "Q69\n",
      "Q70\n",
      "Q71\n",
      "Q72\n",
      "Q73\n"
     ]
    }
   ],
   "source": [
    "query = \"SELECT ?cidoc ?label WHERE {?cidoc rdf:type <http://www.w3.org/2002/07/owl#Class> ; rdfs:label ?label .}\"\n",
    "for row in cidoc.query(query):\n",
    "    #print(str(row[0]), str(row[1]), \" \".join(str(row[1]).split(\" \")[1:]))\n",
    "    statements=[]\n",
    "    statements.append(wdi_core.WDItemID(value=\"Q1\", prop_nr=propertyID[\"instance of\"]))\n",
    "    statements.append(wdi_core.WDUrl(value=str(row[0]), prop_nr=propertyID['exact match']))\n",
    "    item = localEntityEngine(new_item=True, data=statements)\n",
    "    item.set_label(\" \".join(str(row[1]).split(\" \")), lang=\"en\")\n",
    "    #item.set_aliases([str(row[1]), str(row[1]).replace(\" \", \"_\")], lang=\"en\")\n",
    "    print(item.write(login))\n",
    "\n",
    "#propertyClasses\n",
    "query = \"SELECT ?cidoc ?label WHERE {?cidoc rdf:type <http://www.w3.org/2002/07/owl#ObjectProperty> ; rdfs:label ?label .}\"\n",
    "for row in cidoc.query(query):\n",
    "    print(str(row[0]), str(row[1]), \" \".join(str(row[1]).split(\" \")[1:]))\n",
    "    statements=[]\n",
    "    statements.append(wdi_core.WDItemID(value=\"Q2\", prop_nr=propertyID[\"instance of\"]))\n",
    "    statements.append(wdi_core.WDUrl(value=str(row[0]), prop_nr=propertyID[\"exact match\"]))\n",
    "    item = localEntityEngine(new_item=True, data=statements)\n",
    "    item.set_label(\" \".join(str(row[1]).split(\" \")), lang=\"en\")\n",
    "    #item.set_aliases([str(row[1]), str(row[1]).replace(\" \", \"_\")], lang=\"en\")\n",
    "    try:\n",
    "        print(item.write(login))\n",
    "    except:\n",
    "        print(\"ERROR: \"+str(row[1]))\n",
    "        continue\n",
    "\n",
    "qid = dict()\n",
    "query = \"PREFIX wdt: <http://{}.wiki.opencura.com/prop/direct/> SELECT * WHERE {{?item wdt:P3 ?uri .}}\".format(wbstack)\n",
    "for index, row in wdi_core.WDItemEngine.execute_sparql_query(query, as_dataframe = True, endpoint=sparql).iterrows():\n",
    "    qid[row[\"uri\"]] =row[\"item\"].replace(entityUri, \"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "brutal-deviation",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Traceback (most recent call last):\n",
      "  File \"<ipython-input-29-ca45696dead3>\", line 8, in <module>\n",
      "    print(qid[str(row[\"cidoc\"])].replace(entityUri, \"\"))\n",
      "KeyError: 'http://erlangen-crm.org/current/P104_is_subject_to'\n",
      "\n",
      "Q74\n",
      "Q74\n",
      "Q75\n",
      "Q75\n",
      "Q77\n",
      "Q77\n",
      "Q78\n",
      "Q78\n",
      "Q79\n",
      "Q79\n",
      "Q80\n",
      "Q80\n",
      "Q81\n",
      "Q81\n",
      "Q82\n",
      "Q82\n",
      "Traceback (most recent call last):\n",
      "  File \"<ipython-input-29-ca45696dead3>\", line 8, in <module>\n",
      "    print(qid[str(row[\"cidoc\"])].replace(entityUri, \"\"))\n",
      "KeyError: 'http://erlangen-crm.org/current/P167i_was_place_of'\n",
      "\n",
      "Q85\n",
      "Q85\n",
      "Q86\n",
      "Q86\n",
      "Q88\n",
      "Traceback (most recent call last):\n",
      "  File \"<ipython-input-29-ca45696dead3>\", line 11, in <module>\n",
      "    statements.append(wdi_core.WDItemID(value=qid[str(row[\"domain\"])], prop_nr=propertyID[\"domain\"]))\n",
      "KeyError: 'http://erlangen-crm.org/current/E99_Product_Type'\n",
      "\n",
      "Q89\n",
      "Q89\n",
      "Q90\n",
      "Q90\n",
      "Q91\n",
      "Q91\n",
      "Q92\n",
      "Q92\n",
      "Q93\n",
      "Q93\n",
      "Q94\n",
      "Q94\n",
      "Q95\n",
      "Q95\n",
      "Q96\n",
      "Q96\n",
      "Q97\n",
      "Q97\n",
      "Q98\n",
      "Q98\n",
      "Q99\n",
      "Q99\n",
      "Q100\n",
      "Q100\n",
      "Q101\n",
      "Q101\n",
      "Q102\n",
      "Q102\n",
      "Q103\n",
      "Q103\n",
      "Traceback (most recent call last):\n",
      "  File \"<ipython-input-29-ca45696dead3>\", line 8, in <module>\n",
      "    print(qid[str(row[\"cidoc\"])].replace(entityUri, \"\"))\n",
      "KeyError: 'http://erlangen-crm.org/current/P164i_was_time-span_of'\n",
      "\n",
      "Q104\n",
      "Q104\n",
      "Q105\n",
      "Q105\n",
      "Q106\n",
      "Q106\n",
      "Q107\n",
      "Q107\n",
      "Q108\n",
      "Q108\n",
      "Q109\n",
      "Q109\n",
      "Q110\n",
      "Q110\n",
      "Q111\n",
      "Q111\n",
      "Q112\n",
      "Q112\n",
      "Q113\n",
      "Q113\n",
      "Q114\n",
      "Q114\n",
      "Q115\n",
      "Q115\n",
      "Q117\n",
      "Q117\n",
      "Q118\n",
      "Q118\n",
      "Q119\n",
      "Q119\n",
      "Q120\n",
      "Q120\n",
      "Q121\n",
      "Q121\n",
      "Q122\n",
      "Q122\n",
      "Q123\n",
      "Q123\n",
      "Q124\n",
      "Q124\n",
      "Q125\n",
      "Q125\n",
      "Q126\n",
      "Q126\n",
      "Q127\n",
      "Q127\n",
      "Q128\n",
      "Q128\n",
      "Q129\n",
      "Q129\n",
      "Q130\n",
      "Q130\n",
      "Q131\n",
      "Q131\n",
      "Q132\n",
      "Q132\n",
      "Q133\n",
      "Q133\n",
      "Q134\n",
      "Q134\n",
      "Q135\n",
      "Q135\n",
      "Q136\n",
      "Q136\n",
      "Q137\n",
      "Q137\n",
      "Q140\n",
      "Q140\n",
      "Q141\n",
      "Traceback (most recent call last):\n",
      "  File \"<ipython-input-29-ca45696dead3>\", line 11, in <module>\n",
      "    statements.append(wdi_core.WDItemID(value=qid[str(row[\"domain\"])], prop_nr=propertyID[\"domain\"]))\n",
      "KeyError: 'http://erlangen-crm.org/current/E96_Purchase'\n",
      "\n",
      "Q142\n",
      "Q142\n",
      "Traceback (most recent call last):\n",
      "  File \"<ipython-input-29-ca45696dead3>\", line 8, in <module>\n",
      "    print(qid[str(row[\"cidoc\"])].replace(entityUri, \"\"))\n",
      "KeyError: 'http://erlangen-crm.org/current/P196i_is_defined_by'\n",
      "\n",
      "Q143\n",
      "Q143\n",
      "Q144\n",
      "Q144\n",
      "Q145\n",
      "Q145\n",
      "Q146\n",
      "Q146\n",
      "Q147\n",
      "Q147\n",
      "Q148\n",
      "Q148\n",
      "Q149\n",
      "Q149\n",
      "Q150\n",
      "Q150\n",
      "Traceback (most recent call last):\n",
      "  File \"<ipython-input-29-ca45696dead3>\", line 8, in <module>\n",
      "    print(qid[str(row[\"cidoc\"])].replace(entityUri, \"\"))\n",
      "KeyError: 'http://erlangen-crm.org/current/P195i_had_presence'\n",
      "\n",
      "Q151\n",
      "Q151\n",
      "Q152\n",
      "Q152\n",
      "Traceback (most recent call last):\n",
      "  File \"<ipython-input-29-ca45696dead3>\", line 8, in <module>\n",
      "    print(qid[str(row[\"cidoc\"])].replace(entityUri, \"\"))\n",
      "KeyError: 'http://erlangen-crm.org/current/P188i_is_production_tool_for'\n",
      "\n",
      "Q153\n",
      "Q153\n",
      "Q155\n",
      "Q155\n",
      "Q156\n",
      "Q156\n",
      "Traceback (most recent call last):\n",
      "  File \"<ipython-input-29-ca45696dead3>\", line 8, in <module>\n",
      "    print(qid[str(row[\"cidoc\"])].replace(entityUri, \"\"))\n",
      "KeyError: 'http://erlangen-crm.org/current/P166i_had_presence'\n",
      "\n",
      "Q157\n",
      "Q157\n",
      "Q158\n",
      "Q158\n",
      "Q159\n",
      "Q159\n",
      "Q160\n",
      "Q160\n",
      "Q161\n",
      "Q161\n",
      "Q162\n",
      "Q162\n",
      "Q163\n",
      "Q163\n",
      "Q164\n",
      "Q164\n",
      "Q165\n",
      "Q165\n",
      "Q166\n",
      "Q166\n",
      "Q167\n",
      "Q167\n",
      "Q168\n",
      "Q168\n",
      "Q169\n",
      "Q169\n",
      "Q170\n",
      "Q170\n",
      "Q171\n",
      "Q171\n",
      "Q172\n",
      "Q172\n",
      "Q173\n",
      "Q173\n",
      "Traceback (most recent call last):\n",
      "  File \"<ipython-input-29-ca45696dead3>\", line 8, in <module>\n",
      "    print(qid[str(row[\"cidoc\"])].replace(entityUri, \"\"))\n",
      "KeyError: 'http://erlangen-crm.org/current/P187i_is_production_plan_for'\n",
      "\n",
      "Q174\n",
      "Q174\n",
      "Q175\n",
      "Q175\n",
      "Q176\n",
      "Q176\n",
      "Q177\n",
      "Q177\n",
      "Q178\n",
      "Q178\n",
      "Q179\n",
      "Q179\n",
      "Q180\n",
      "Q180\n",
      "Q181\n",
      "Q181\n",
      "Q182\n",
      "Q182\n",
      "Q183\n",
      "Q183\n",
      "Q184\n",
      "Q184\n",
      "Q185\n",
      "Q185\n",
      "Q186\n",
      "Q186\n",
      "Q187\n",
      "Q187\n",
      "Q188\n",
      "Q188\n",
      "Q189\n",
      "Q189\n",
      "Q190\n",
      "Q190\n",
      "Q191\n",
      "Q191\n",
      "Q192\n",
      "Q192\n",
      "Q193\n",
      "Q193\n",
      "Q194\n",
      "Q194\n",
      "Q196\n",
      "Q196\n",
      "Q197\n",
      "Q197\n",
      "Q198\n",
      "Q198\n",
      "Q199\n",
      "Q199\n",
      "Q200\n",
      "Q200\n",
      "Q201\n",
      "Q201\n",
      "Q202\n",
      "Q202\n",
      "Q203\n",
      "Q203\n",
      "Q204\n",
      "Q204\n",
      "Q205\n",
      "Q205\n",
      "Q206\n",
      "Q206\n",
      "Q207\n",
      "Q207\n",
      "Q208\n",
      "Q208\n",
      "Q209\n",
      "Q209\n",
      "Q210\n",
      "Q210\n",
      "Q211\n",
      "Q211\n",
      "Q212\n",
      "Q212\n",
      "Q213\n",
      "Q213\n",
      "Q214\n",
      "Q214\n",
      "Q215\n",
      "Q215\n",
      "Q216\n",
      "Q216\n",
      "Q217\n",
      "Q217\n",
      "Q218\n",
      "Q218\n",
      "Q219\n",
      "Q219\n",
      "Q220\n",
      "Q220\n",
      "Q221\n",
      "Q221\n",
      "Q222\n",
      "Q222\n",
      "Q223\n",
      "Q223\n",
      "Q224\n",
      "Q224\n",
      "Q225\n",
      "Q225\n",
      "Q226\n",
      "Q226\n",
      "Q227\n",
      "Q227\n",
      "Q228\n",
      "Q228\n",
      "Q229\n",
      "Q229\n",
      "Q230\n",
      "Q230\n",
      "Traceback (most recent call last):\n",
      "  File \"<ipython-input-29-ca45696dead3>\", line 8, in <module>\n",
      "    print(qid[str(row[\"cidoc\"])].replace(entityUri, \"\"))\n",
      "KeyError: 'http://erlangen-crm.org/current/P189i_is_approximated_by'\n",
      "\n",
      "Q231\n",
      "Q231\n",
      "Traceback (most recent call last):\n",
      "  File \"<ipython-input-29-ca45696dead3>\", line 8, in <module>\n",
      "    print(qid[str(row[\"cidoc\"])].replace(entityUri, \"\"))\n",
      "KeyError: 'http://erlangen-crm.org/current/P165_incorporates'\n",
      "\n",
      "Q232\n",
      "Q232\n",
      "Q233\n",
      "Q233\n",
      "Q235\n",
      "Q235\n",
      "Q236\n",
      "Q236\n",
      "Q237\n",
      "Q237\n",
      "Q238\n",
      "Q238\n",
      "Q239\n",
      "Q239\n",
      "Q240\n",
      "Q240\n",
      "Q241\n",
      "Q241\n",
      "Q242\n",
      "Q242\n",
      "Q243\n",
      "Q243\n",
      "Q244\n",
      "Q244\n",
      "Q245\n",
      "Traceback (most recent call last):\n",
      "  File \"<ipython-input-29-ca45696dead3>\", line 11, in <module>\n",
      "    statements.append(wdi_core.WDItemID(value=qid[str(row[\"domain\"])], prop_nr=propertyID[\"domain\"]))\n",
      "KeyError: 'http://erlangen-crm.org/current/E97_Monetary_Amount'\n",
      "\n",
      "Q246\n",
      "Q246\n",
      "Q247\n",
      "Q247\n",
      "Q248\n",
      "Q248\n",
      "Q249\n",
      "Q249\n",
      "Q250\n",
      "Q250\n",
      "Q251\n",
      "Q251\n",
      "Q252\n",
      "Q252\n",
      "Q253\n",
      "Q253\n",
      "Q254\n",
      "Q254\n",
      "Q255\n",
      "Q255\n",
      "Q256\n",
      "Q256\n",
      "Q257\n",
      "Q257\n",
      "Q258\n",
      "Q258\n",
      "Traceback (most recent call last):\n",
      "  File \"<ipython-input-29-ca45696dead3>\", line 8, in <module>\n",
      "    print(qid[str(row[\"cidoc\"])].replace(entityUri, \"\"))\n",
      "KeyError: 'http://erlangen-crm.org/current/P191i_was_duration_of'\n",
      "\n",
      "Q259\n",
      "Q259\n",
      "Q260\n",
      "Q260\n",
      "Q261\n",
      "Q261\n",
      "Q262\n",
      "Q262\n",
      "Q263\n",
      "Q263\n",
      "Q264\n",
      "Q264\n",
      "Q265\n",
      "Q265\n",
      "Q266\n",
      "Q266\n",
      "Q267\n",
      "Q267\n",
      "Q268\n",
      "Q268\n",
      "Q269\n",
      "Q269\n",
      "Traceback (most recent call last):\n",
      "  File \"<ipython-input-29-ca45696dead3>\", line 8, in <module>\n",
      "    print(qid[str(row[\"cidoc\"])].replace(entityUri, \"\"))\n",
      "KeyError: 'http://erlangen-crm.org/current/P166_was_a_presence_of'\n",
      "\n",
      "Q270\n",
      "Q270\n",
      "Q271\n",
      "Q271\n",
      "Q272\n",
      "Q272\n",
      "Q273\n",
      "Q273\n",
      "Q274\n",
      "Q274\n",
      "Q275\n",
      "Traceback (most recent call last):\n",
      "  File \"<ipython-input-29-ca45696dead3>\", line 11, in <module>\n",
      "    statements.append(wdi_core.WDItemID(value=qid[str(row[\"domain\"])], prop_nr=propertyID[\"domain\"]))\n",
      "KeyError: 'http://erlangen-crm.org/current/E99_Product_Type'\n",
      "\n",
      "Q276\n",
      "Q276\n",
      "Q277\n",
      "Q277\n",
      "Q278\n",
      "Q278\n",
      "Q279\n",
      "Q279\n",
      "Q280\n",
      "Q280\n",
      "Q281\n",
      "Q281\n",
      "Q282\n",
      "Q282\n",
      "Q283\n",
      "Q283\n",
      "Q284\n",
      "Q284\n",
      "Q285\n",
      "Q285\n",
      "Q286\n",
      "Q286\n",
      "Traceback (most recent call last):\n",
      "  File \"<ipython-input-29-ca45696dead3>\", line 8, in <module>\n",
      "    print(qid[str(row[\"cidoc\"])].replace(entityUri, \"\"))\n",
      "KeyError: 'http://erlangen-crm.org/current/P180i_was_currency_of'\n",
      "\n",
      "Q287\n",
      "Q287\n",
      "Q288\n",
      "Q288\n",
      "Q289\n",
      "Q289\n",
      "Q290\n",
      "Q290\n",
      "Q291\n",
      "Q291\n",
      "Q292\n",
      "Q292\n",
      "Q293\n",
      "Q293\n",
      "Q294\n",
      "Q294\n",
      "Q295\n",
      "Q295\n",
      "Q296\n",
      "Q296\n",
      "Q297\n",
      "Q297\n",
      "Q298\n",
      "Q298\n",
      "Q299\n",
      "Q299\n",
      "Q300\n",
      "Q300\n",
      "Q301\n",
      "Q301\n",
      "Q302\n",
      "Q302\n",
      "Q303\n",
      "Q303\n",
      "Q304\n",
      "Q304\n",
      "Q305\n",
      "Q305\n",
      "Q306\n",
      "Q306\n",
      "Q307\n",
      "Q307\n",
      "Q308\n",
      "Q308\n",
      "Q309\n",
      "Q309\n",
      "Q310\n",
      "Q310\n",
      "Q311\n",
      "Q311\n",
      "Q312\n",
      "Q312\n",
      "Q313\n",
      "Q313\n",
      "Q314\n",
      "Q314\n",
      "Q315\n",
      "Q315\n",
      "Q316\n",
      "Q316\n",
      "Q317\n",
      "Q317\n",
      "Q318\n",
      "Q318\n",
      "Traceback (most recent call last):\n",
      "  File \"<ipython-input-29-ca45696dead3>\", line 8, in <module>\n",
      "    print(qid[str(row[\"cidoc\"])].replace(entityUri, \"\"))\n",
      "KeyError: 'http://erlangen-crm.org/current/P167_at'\n",
      "\n",
      "Q319\n",
      "Q319\n",
      "Q320\n",
      "Q320\n",
      "Q321\n",
      "Q321\n",
      "Q322\n",
      "Q322\n",
      "Q323\n",
      "Q323\n",
      "Q325\n",
      "Q325\n",
      "Q326\n",
      "Q326\n",
      "Q327\n",
      "Q327\n",
      "Q328\n",
      "Q328\n",
      "Q329\n",
      "Q329\n",
      "Q330\n",
      "Q330\n",
      "Q331\n",
      "Q331\n",
      "Q332\n",
      "Q332\n",
      "Q333\n",
      "Q333\n",
      "Q334\n",
      "Q334\n"
     ]
    }
   ],
   "source": [
    "\n",
    "query = \"\"\"SELECT DISTINCT ?cidoc ?domain  WHERE {\n",
    "                 ?cidoc rdf:type <http://www.w3.org/2002/07/owl#ObjectProperty> ; \n",
    "                        rdfs:domain ?domain .}\"\"\"\n",
    "for row in cidoc.query(query):\n",
    "    try:\n",
    "        print(qid[str(row[\"cidoc\"])].replace(entityUri, \"\"))\n",
    "        localEntityEngine = wdi_core.WDItemEngine.wikibase_item_engine_factory(api,sparql)\n",
    "        statements=[]\n",
    "        statements.append(wdi_core.WDItemID(value=qid[str(row[\"domain\"])], prop_nr=propertyID[\"domain\"]))\n",
    "        item = localEntityEngine(wd_item_id=qid[str(row[\"cidoc\"])], data=statements)\n",
    "        print(item.write(login))\n",
    "    except Exception as e:\n",
    "        print(traceback.format_exc())\n",
    "        continue\n",
    "\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "emotional-constitution",
   "metadata": {},
   "source": [
    "# Add CIDOC-CRM relations\n",
    "## Domain"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "disciplinary-landing",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Q74\n",
      "Q74\n",
      "Q75\n",
      "Q75\n",
      "Q76\n",
      "Q76\n",
      "Q77\n",
      "Q77\n",
      "Q78\n",
      "Q78\n",
      "Q79\n",
      "Q79\n",
      "Q80\n",
      "Q80\n",
      "Q81\n",
      "Q81\n",
      "Q82\n",
      "Q82\n",
      "Q83\n",
      "Q83\n",
      "Q84\n",
      "Q84\n",
      "Q85\n",
      "Q85\n",
      "Q86\n",
      "Q86\n",
      "Q87\n",
      "Q87\n",
      "Q88\n",
      "Q88\n",
      "Q90\n",
      "Q90\n",
      "Q91\n",
      "Q91\n",
      "Q92\n",
      "Q92\n",
      "Q93\n",
      "Q93\n",
      "Q94\n",
      "Q94\n",
      "Q95\n",
      "Q95\n",
      "Q96\n",
      "Q96\n",
      "Q97\n",
      "Q97\n",
      "Q98\n",
      "Q98\n",
      "Q99\n",
      "Q99\n",
      "Q100\n",
      "Q100\n",
      "Q101\n",
      "Q102\n",
      "Q102\n",
      "Q103\n",
      "Q103\n",
      "Q104\n",
      "Q104\n",
      "Q105\n",
      "Q105\n",
      "Q106\n",
      "Q106\n",
      "Q107\n",
      "Q107\n",
      "Q108\n",
      "Q108\n",
      "Q109\n",
      "Q109\n",
      "Q110\n",
      "Q110\n",
      "Q111\n",
      "Q111\n",
      "Q112\n",
      "Q112\n",
      "Q113\n",
      "Q113\n",
      "Q114\n",
      "Q114\n",
      "Q115\n",
      "Q115\n",
      "Q116\n",
      "Q116\n",
      "Q117\n",
      "Q117\n",
      "Q118\n",
      "Q118\n",
      "Q119\n",
      "Q119\n",
      "Q120\n",
      "Q120\n",
      "Q121\n",
      "Q121\n",
      "Q122\n",
      "Q122\n",
      "Q123\n",
      "Q123\n",
      "Q124\n",
      "Q124\n",
      "Q125\n",
      "Q125\n",
      "Q126\n",
      "Q126\n",
      "Q127\n",
      "Q127\n",
      "Q128\n",
      "Q128\n",
      "Q129\n",
      "Q129\n",
      "Q130\n",
      "Q130\n",
      "Q131\n",
      "Q131\n",
      "Q132\n",
      "Q132\n",
      "Q133\n",
      "Q133\n",
      "Q134\n",
      "Q134\n",
      "Q135\n",
      "Q135\n",
      "Q136\n",
      "Q136\n",
      "Q137\n",
      "Q137\n",
      "Q139\n",
      "Q139\n",
      "Q140\n",
      "Q140\n",
      "Q141\n",
      "Q142\n",
      "Q142\n",
      "Q143\n",
      "Q143\n",
      "Q144\n",
      "Q144\n",
      "Q145\n",
      "Q145\n",
      "Q146\n",
      "Q146\n",
      "Q147\n",
      "Q147\n",
      "Q148\n",
      "Q148\n",
      "Q149\n",
      "Q149\n",
      "Q150\n",
      "Q150\n",
      "Q151\n",
      "Q151\n",
      "Q152\n",
      "Q152\n",
      "Q153\n",
      "Q153\n",
      "Q154\n",
      "Q154\n",
      "Q155\n",
      "Q155\n",
      "Q156\n",
      "Q156\n",
      "Q157\n",
      "Q157\n",
      "Q158\n",
      "Q158\n",
      "Q159\n",
      "Q159\n",
      "Q160\n",
      "Q160\n",
      "Q161\n",
      "Q161\n",
      "Q164\n",
      "Q164\n",
      "Q165\n",
      "Q165\n",
      "Q166\n",
      "Q166\n",
      "Q167\n",
      "Q167\n",
      "Q168\n",
      "Q168\n",
      "Q172\n",
      "Q172\n",
      "Q173\n",
      "Q173\n",
      "Q174\n",
      "Q174\n",
      "Q175\n",
      "Q175\n",
      "Q176\n",
      "Q176\n",
      "Q177\n",
      "Q177\n",
      "Q178\n",
      "Q178\n",
      "Q179\n",
      "Q179\n",
      "Q180\n",
      "Q180\n",
      "Q181\n",
      "Q181\n",
      "Q182\n",
      "Q182\n",
      "Q183\n",
      "Q183\n",
      "Q184\n",
      "Q184\n",
      "Q185\n",
      "Q185\n",
      "Q186\n",
      "Q186\n",
      "Q187\n",
      "Q187\n",
      "Q188\n",
      "Q188\n",
      "Q189\n",
      "Q189\n",
      "Q190\n",
      "Q190\n",
      "Q191\n",
      "Q191\n",
      "Q192\n",
      "Q192\n",
      "Q193\n",
      "Q193\n",
      "Q194\n",
      "Q194\n",
      "Q195\n",
      "Q195\n",
      "Q196\n",
      "Q196\n",
      "Q197\n",
      "Q197\n",
      "Q198\n",
      "Q198\n",
      "Q199\n",
      "Q199\n",
      "Q200\n",
      "Q200\n",
      "Q201\n",
      "Q201\n",
      "Q202\n",
      "Q202\n",
      "Q203\n",
      "Q203\n",
      "Q204\n",
      "Q204\n",
      "Q205\n",
      "Q205\n",
      "Q206\n",
      "Q206\n",
      "Q207\n",
      "Q207\n",
      "Q208\n",
      "Q208\n",
      "Q209\n",
      "Q209\n",
      "Q210\n",
      "Q210\n",
      "Q211\n",
      "Q211\n",
      "Q212\n",
      "Q212\n",
      "Q213\n",
      "Q213\n",
      "Q214\n",
      "Q214\n",
      "Q215\n",
      "Q215\n",
      "Q216\n",
      "Q216\n",
      "Q217\n",
      "Q217\n",
      "Q218\n",
      "Q218\n",
      "Q219\n",
      "Q219\n",
      "Q220\n",
      "Q220\n",
      "Q221\n",
      "Q221\n",
      "Q222\n",
      "Q222\n",
      "Q223\n",
      "Q223\n",
      "Q224\n",
      "Q224\n",
      "Q225\n",
      "Q225\n",
      "Q226\n",
      "Q226\n",
      "Q227\n",
      "Q227\n",
      "Q228\n",
      "Q228\n",
      "Q229\n",
      "Q229\n",
      "Q230\n",
      "Q230\n",
      "Q232\n",
      "Q232\n",
      "Q233\n",
      "Q233\n",
      "Q234\n",
      "Q234\n",
      "Q235\n",
      "Q235\n",
      "Q237\n",
      "Q237\n",
      "Q238\n",
      "Q238\n",
      "Q239\n",
      "Q239\n",
      "Q240\n",
      "Q240\n",
      "Q241\n",
      "Q241\n",
      "Q242\n",
      "Q242\n",
      "Q243\n",
      "Q243\n",
      "Q244\n",
      "Q244\n",
      "Q245\n",
      "Q246\n",
      "Q246\n",
      "Q247\n",
      "Q247\n",
      "Q248\n",
      "Q248\n",
      "Q249\n",
      "Q249\n",
      "Q250\n",
      "Q250\n",
      "Q251\n",
      "Q251\n",
      "Q252\n",
      "Q252\n",
      "Q253\n",
      "Q253\n",
      "Q254\n",
      "Q254\n",
      "Q255\n",
      "Q255\n",
      "Q256\n",
      "Q256\n",
      "Q257\n",
      "Q257\n",
      "Q258\n",
      "Q258\n",
      "Q259\n",
      "Q259\n",
      "Q260\n",
      "Q260\n",
      "Q261\n",
      "Q261\n",
      "Q262\n",
      "Q262\n",
      "Q263\n",
      "Q263\n",
      "Q264\n",
      "Q264\n",
      "Q265\n",
      "Q265\n",
      "Q267\n",
      "Q267\n",
      "Q268\n",
      "Q268\n",
      "Q269\n",
      "Q269\n",
      "Q270\n",
      "Q270\n",
      "Q271\n",
      "Q271\n",
      "Q272\n",
      "Q272\n",
      "Q273\n",
      "Q273\n",
      "Q274\n",
      "Q274\n",
      "Q275\n",
      "Q275\n",
      "Q276\n",
      "Q276\n",
      "Q277\n",
      "Q277\n",
      "Q278\n",
      "Q278\n",
      "Q279\n",
      "Q279\n",
      "Q280\n",
      "Q280\n",
      "Q281\n",
      "Q281\n",
      "Q282\n",
      "Q282\n",
      "Q283\n",
      "Q283\n",
      "Q284\n",
      "Q284\n",
      "Q285\n",
      "Q285\n",
      "Q286\n",
      "Q286\n",
      "Q287\n",
      "Q287\n",
      "Q288\n",
      "Q288\n",
      "Q289\n",
      "Q289\n",
      "Q290\n",
      "Q290\n",
      "Q291\n",
      "Q291\n",
      "Q292\n",
      "Q292\n",
      "Q293\n",
      "Q293\n",
      "Q294\n",
      "Q294\n",
      "Q295\n",
      "Q295\n",
      "Q296\n",
      "Q296\n",
      "Q297\n",
      "Q297\n",
      "Q299\n",
      "Q299\n",
      "Q300\n",
      "Q300\n",
      "Q301\n",
      "Q301\n",
      "Q302\n",
      "Q302\n",
      "Q303\n",
      "Q303\n",
      "Q304\n",
      "Q304\n",
      "Q305\n",
      "Q305\n",
      "Q306\n",
      "Q306\n",
      "Q307\n",
      "Q307\n",
      "Q308\n",
      "Q308\n",
      "Q309\n",
      "Q309\n",
      "Q310\n",
      "Q310\n",
      "Q311\n",
      "Q311\n",
      "Q312\n",
      "Q312\n",
      "Q313\n",
      "Q313\n",
      "Q314\n",
      "Q314\n",
      "Q315\n",
      "Q315\n",
      "Q316\n",
      "Q316\n",
      "Q317\n",
      "Q317\n",
      "Q318\n",
      "Q318\n",
      "Q319\n",
      "Q319\n",
      "Q320\n",
      "Q320\n",
      "Q321\n",
      "Q321\n",
      "Q322\n",
      "Q322\n",
      "Q323\n",
      "Q323\n",
      "Q325\n",
      "Q325\n",
      "Q326\n",
      "Q326\n",
      "Q327\n",
      "Q327\n",
      "Q328\n",
      "Q328\n",
      "Q329\n",
      "Q329\n",
      "Q330\n",
      "Q330\n",
      "Q331\n",
      "Q331\n",
      "Q332\n",
      "Q332\n",
      "Q333\n",
      "Q333\n",
      "Q334\n",
      "Q334\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"SELECT DISTINCT ?cidoc ?range  WHERE {\n",
    "                 ?cidoc rdf:type <http://www.w3.org/2002/07/owl#ObjectProperty> ; \n",
    "                        rdfs:range ?range .}\"\"\"\n",
    "for row in cidoc.query(query):\n",
    "    try:\n",
    "        print(qid[str(row[\"cidoc\"])])\n",
    "        localEntityEngine = wdi_core.WDItemEngine.wikibase_item_engine_factory(api,sparql)\n",
    "        statements=[]\n",
    "        statements.append(wdi_core.WDItemID(value=qid[str(row[\"range\"])].replace(entityUri, \"\"), prop_nr=propertyID[\"range\"]))\n",
    "        item = localEntityEngine(wd_item_id=qid[str(row[\"cidoc\"])].replace(entityUri, \"\"), data=statements)\n",
    "        print(item.write(login))\n",
    "    except:\n",
    "        str(row[\"cidoc\"])\n",
    "        continue"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "fleet-thinking",
   "metadata": {},
   "outputs": [],
   "source": [
    "## SubPropertyOf"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "mysterious-pride",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Q74\n",
      "Q74\n",
      "Q74\n",
      "Q74\n",
      "Q77\n",
      "Q77\n",
      "Q79\n",
      "Q79\n",
      "Q79\n",
      "Q79\n",
      "Q80\n",
      "Q80\n",
      "Q82\n",
      "Q82\n",
      "Q83\n",
      "Q83\n",
      "Q84\n",
      "Q84\n",
      "Q85\n",
      "Q85\n",
      "Q86\n",
      "Q86\n",
      "Q87\n",
      "Q87\n",
      "Q94\n",
      "Q94\n",
      "Q95\n",
      "Q95\n",
      "Q96\n",
      "Q96\n",
      "Q97\n",
      "Q97\n",
      "Q102\n",
      "Q102\n",
      "Q104\n",
      "Q104\n",
      "Q105\n",
      "Q105\n",
      "Q106\n",
      "Q106\n",
      "Q107\n",
      "Q107\n",
      "Q108\n",
      "Q108\n",
      "Q109\n",
      "Q109\n",
      "Q111\n",
      "Q111\n",
      "Q113\n",
      "Q113\n",
      "Q114\n",
      "Q114\n",
      "Q116\n",
      "Q116\n",
      "Q118\n",
      "Q118\n",
      "Q120\n",
      "Q120\n",
      "Q121\n",
      "Q121\n",
      "Q123\n",
      "Q123\n",
      "Q124\n",
      "Q124\n",
      "Q125\n",
      "Q125\n",
      "Q127\n",
      "Q127\n",
      "Q128\n",
      "Q128\n",
      "Q129\n",
      "Q129\n",
      "Q130\n",
      "Q130\n",
      "Q133\n",
      "Q133\n",
      "Q135\n",
      "Q135\n",
      "Q137\n",
      "Q137\n",
      "Q139\n",
      "Q139\n",
      "Q144\n",
      "Q144\n",
      "Q146\n",
      "Q146\n",
      "Q149\n",
      "Q149\n",
      "Q151\n",
      "Q151\n",
      "Q152\n",
      "Q152\n",
      "Q154\n",
      "Q154\n",
      "Q158\n",
      "Q158\n",
      "Q160\n",
      "Q160\n",
      "Q161\n",
      "Q161\n",
      "Q164\n",
      "Q164\n",
      "Q165\n",
      "Q165\n",
      "Q166\n",
      "Q166\n",
      "Q168\n",
      "Q168\n",
      "Q174\n",
      "Q174\n",
      "Q174\n",
      "Q174\n",
      "Q177\n",
      "Q177\n",
      "Q178\n",
      "Q178\n",
      "Q181\n",
      "Q181\n",
      "Q182\n",
      "Q182\n",
      "Q183\n",
      "Q183\n",
      "Q186\n",
      "Q186\n",
      "Q189\n",
      "Q189\n",
      "Q189\n",
      "Q189\n",
      "Q190\n",
      "Q190\n",
      "Q191\n",
      "Q191\n",
      "Q194\n",
      "Q194\n",
      "Q195\n",
      "Q195\n",
      "Q195\n",
      "Q195\n",
      "Q197\n",
      "Q197\n",
      "Q198\n",
      "Q198\n",
      "Q200\n",
      "Q200\n",
      "Q202\n",
      "Q202\n",
      "Q204\n",
      "Q204\n",
      "Q205\n",
      "Q205\n",
      "Q207\n",
      "Q207\n",
      "Q211\n",
      "Q211\n",
      "Q212\n",
      "Q212\n",
      "Q215\n",
      "Q215\n",
      "Q215\n",
      "Q215\n",
      "Q216\n",
      "Q216\n",
      "Q219\n",
      "Q219\n",
      "Q219\n",
      "Q219\n",
      "Q220\n",
      "Q220\n",
      "Q221\n",
      "Q221\n",
      "Q222\n",
      "Q222\n",
      "Q223\n",
      "Q223\n",
      "Q225\n",
      "Q225\n",
      "Q226\n",
      "Q226\n",
      "Q229\n",
      "Q229\n",
      "Q232\n",
      "Q232\n",
      "Q234\n",
      "Q234\n",
      "Q237\n",
      "Q237\n",
      "Q238\n",
      "Q238\n",
      "Q245\n",
      "Q245\n",
      "Q247\n",
      "Q247\n",
      "Q248\n",
      "Q248\n",
      "Q248\n",
      "Q248\n",
      "Q249\n",
      "Q249\n",
      "Q251\n",
      "Q251\n",
      "Q254\n",
      "Q254\n",
      "Q255\n",
      "Q255\n",
      "Q258\n",
      "Q258\n",
      "Q259\n",
      "Q259\n",
      "Q261\n",
      "Q261\n",
      "Q262\n",
      "Q262\n",
      "Q263\n",
      "Q263\n",
      "Q265\n",
      "Q265\n",
      "Q268\n",
      "Q268\n",
      "Q269\n",
      "Q269\n",
      "Q271\n",
      "Q271\n",
      "Q277\n",
      "Q277\n",
      "Q280\n",
      "Q280\n",
      "Q280\n",
      "Q280\n",
      "Q281\n",
      "Q281\n",
      "Q284\n",
      "Q284\n",
      "Q284\n",
      "Q284\n",
      "Q285\n",
      "Q285\n",
      "Q287\n",
      "Q287\n",
      "Q288\n",
      "Q288\n",
      "Q290\n",
      "Q290\n",
      "Q293\n",
      "Q293\n",
      "Q294\n",
      "Q294\n",
      "Q296\n",
      "Q296\n",
      "Q302\n",
      "Q302\n",
      "Q303\n",
      "Q303\n",
      "Q305\n",
      "Q305\n",
      "Q306\n",
      "Q306\n",
      "Q307\n",
      "Q307\n",
      "Q307\n",
      "Q307\n",
      "Q308\n",
      "Q308\n",
      "Q308\n",
      "Q308\n",
      "Q310\n",
      "Q310\n",
      "Q312\n",
      "Q312\n",
      "Q313\n",
      "Q313\n",
      "Q318\n",
      "Q318\n",
      "Q319\n",
      "Q319\n",
      "Q320\n",
      "Q320\n",
      "Q322\n",
      "Q322\n",
      "Q323\n",
      "Q323\n",
      "Q326\n",
      "Q326\n",
      "Q326\n",
      "Q326\n",
      "Q329\n",
      "Q329\n",
      "Q330\n",
      "Q330\n",
      "Q331\n",
      "Q331\n",
      "Q333\n",
      "Q333\n",
      "Q334\n",
      "Q334\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"SELECT DISTINCT ?cidoc ?subPropertyOf  WHERE {\n",
    "                 ?cidoc rdf:type <http://www.w3.org/2002/07/owl#ObjectProperty> ; \n",
    "                        rdfs:subPropertyOf ?subPropertyOf ;\n",
    "                        rdfs:range ?range .}\"\"\"\n",
    "for row in cidoc.query(query):\n",
    "    try:\n",
    "        print(qid[str(row[\"cidoc\"])])\n",
    "        localEntityEngine = wdi_core.WDItemEngine.wikibase_item_engine_factory(api,sparql)\n",
    "        statements=[]\n",
    "        statements.append(wdi_core.WDItemID(value=qid[str(row[\"subPropertyOf\"])], prop_nr=propertyID[\"subproperty of\"]))\n",
    "        item = localEntityEngine(wd_item_id=qid[str(row[\"cidoc\"])], data=statements)\n",
    "        print(item.write(login))\n",
    "    except:\n",
    "        continue"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "engaging-trinity",
   "metadata": {},
   "outputs": [],
   "source": [
    "## InverseOf"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "dying-photograph",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Q74\n",
      "Q74\n",
      "Q75\n",
      "Q76\n",
      "Q76\n",
      "Q77\n",
      "Q77\n",
      "Q78\n",
      "Q78\n",
      "Q79\n",
      "Q79\n",
      "Q80\n",
      "Q80\n",
      "Q81\n",
      "Q81\n",
      "Q82\n",
      "Q82\n",
      "Q83\n",
      "Q83\n",
      "Q84\n",
      "Q84\n",
      "Q85\n",
      "Q85\n",
      "Q86\n",
      "Q87\n",
      "Q87\n",
      "Q88\n",
      "Q90\n",
      "Q90\n",
      "Q91\n",
      "Q91\n",
      "Q92\n",
      "Q92\n",
      "Q93\n",
      "Q93\n",
      "Q94\n",
      "Q94\n",
      "Q95\n",
      "Q95\n",
      "Q96\n",
      "Q96\n",
      "Q97\n",
      "Q97\n",
      "Q98\n",
      "Q98\n",
      "Q99\n",
      "Q99\n",
      "Q100\n",
      "Q100\n",
      "Q101\n",
      "Q101\n",
      "Q102\n",
      "Q102\n",
      "Q103\n",
      "Q103\n",
      "Q104\n",
      "Q104\n",
      "Q105\n",
      "Q105\n",
      "Q106\n",
      "Q106\n",
      "Q107\n",
      "Q107\n",
      "Q108\n",
      "Q108\n",
      "Q109\n",
      "Q109\n",
      "Q110\n",
      "Q110\n",
      "Q111\n",
      "Q111\n",
      "Q112\n",
      "Q112\n",
      "Q113\n",
      "Q113\n",
      "Q114\n",
      "Q114\n",
      "Q115\n",
      "Q115\n",
      "Q116\n",
      "Q116\n",
      "Q117\n",
      "Q117\n",
      "Q118\n",
      "Q118\n",
      "Q119\n",
      "Q119\n",
      "Q120\n",
      "Q120\n",
      "Q121\n",
      "Q121\n",
      "Q122\n",
      "Q122\n",
      "Q123\n",
      "Q123\n",
      "Q124\n",
      "Q124\n",
      "Q125\n",
      "Q125\n",
      "Q126\n",
      "Q126\n",
      "Q127\n",
      "Q127\n",
      "Q128\n",
      "Q128\n",
      "Q129\n",
      "Q129\n",
      "Q130\n",
      "Q130\n",
      "Q131\n",
      "Q131\n",
      "Q132\n",
      "Q132\n",
      "Q133\n",
      "Q133\n",
      "Q134\n",
      "Q134\n",
      "Q135\n",
      "Q135\n",
      "Q136\n",
      "Q136\n",
      "Q137\n",
      "Q137\n",
      "Q139\n",
      "Q139\n",
      "Q140\n",
      "Q140\n",
      "Q141\n",
      "Q142\n",
      "Q142\n",
      "Q143\n",
      "Q143\n",
      "Q144\n",
      "Q144\n",
      "Q145\n",
      "Q145\n",
      "Q146\n",
      "Q146\n",
      "Q147\n",
      "Q147\n",
      "Q148\n",
      "Q148\n",
      "Q149\n",
      "Q149\n",
      "Q150\n",
      "Q150\n",
      "Q151\n",
      "Q151\n",
      "Q152\n",
      "Q152\n",
      "Q153\n",
      "Q154\n",
      "Q154\n",
      "Q155\n",
      "Q155\n",
      "Q156\n",
      "Q156\n",
      "Q157\n",
      "Q157\n",
      "Q158\n",
      "Q158\n",
      "Q159\n",
      "Q159\n",
      "Q160\n",
      "Q160\n",
      "Q161\n",
      "Q161\n",
      "Q164\n",
      "Q164\n",
      "Q165\n",
      "Q165\n",
      "Q166\n",
      "Q166\n",
      "Q167\n",
      "Q167\n",
      "Q168\n",
      "Q168\n",
      "Q172\n",
      "Q172\n",
      "Q173\n",
      "Q173\n",
      "Q174\n",
      "Q174\n",
      "Q175\n",
      "Q175\n",
      "Q176\n",
      "Q176\n",
      "Q177\n",
      "Q177\n",
      "Q178\n",
      "Q178\n",
      "Q179\n",
      "Q179\n",
      "Q180\n",
      "Q180\n",
      "Q181\n",
      "Q181\n",
      "Q182\n",
      "Q182\n",
      "Q183\n",
      "Q183\n",
      "Q184\n",
      "Q184\n",
      "Q185\n",
      "Q185\n",
      "Q186\n",
      "Q187\n",
      "Q187\n",
      "Q188\n",
      "Q188\n",
      "Q189\n",
      "Q189\n",
      "Q190\n",
      "Q190\n",
      "Q191\n",
      "Q192\n",
      "Q192\n",
      "Q193\n",
      "Q193\n",
      "Q194\n",
      "Q194\n",
      "Q195\n",
      "Q195\n",
      "Q196\n",
      "Q196\n",
      "Q197\n",
      "Q197\n",
      "Q198\n",
      "Q198\n",
      "Q199\n",
      "Q199\n",
      "Q200\n",
      "Q200\n",
      "Q201\n",
      "Q201\n",
      "Q202\n",
      "Q202\n",
      "Q203\n",
      "Q204\n",
      "Q204\n",
      "Q206\n",
      "Q206\n",
      "Q207\n",
      "Q207\n",
      "Q208\n",
      "Q208\n",
      "Q209\n",
      "Q209\n",
      "Q210\n",
      "Q210\n",
      "Q211\n",
      "Q211\n",
      "Q212\n",
      "Q212\n",
      "Q213\n",
      "Q213\n",
      "Q214\n",
      "Q214\n",
      "Q215\n",
      "Q216\n",
      "Q216\n",
      "Q217\n",
      "Q217\n",
      "Q218\n",
      "Q218\n",
      "Q219\n",
      "Q219\n",
      "Q220\n",
      "Q220\n",
      "Q221\n",
      "Q221\n",
      "Q222\n",
      "Q222\n",
      "Q223\n",
      "Q223\n",
      "Q224\n",
      "Q224\n",
      "Q225\n",
      "Q225\n",
      "Q226\n",
      "Q226\n",
      "Q227\n",
      "Q227\n",
      "Q228\n",
      "Q228\n",
      "Q229\n",
      "Q229\n",
      "Q230\n",
      "Q230\n",
      "Q232\n",
      "Q232\n",
      "Q233\n",
      "Q233\n",
      "Q234\n",
      "Q234\n",
      "Q235\n",
      "Q235\n",
      "Q237\n",
      "Q237\n",
      "Q238\n",
      "Q238\n",
      "Q239\n",
      "Q239\n",
      "Q240\n",
      "Q240\n",
      "Q241\n",
      "Q241\n",
      "Q242\n",
      "Q242\n",
      "Q243\n",
      "Q243\n",
      "Q244\n",
      "Q244\n",
      "Q245\n",
      "Q246\n",
      "Q246\n",
      "Q247\n",
      "Q247\n",
      "Q248\n",
      "Q248\n",
      "Q249\n",
      "Q249\n",
      "Q250\n",
      "Q250\n",
      "Q251\n",
      "Q251\n",
      "Q252\n",
      "Q252\n",
      "Q253\n",
      "Q253\n",
      "Q254\n",
      "Q254\n",
      "Q255\n",
      "Q255\n",
      "Q256\n",
      "Q256\n",
      "Q257\n",
      "Q257\n",
      "Q258\n",
      "Q258\n",
      "Q259\n",
      "Q259\n",
      "Q260\n",
      "Q260\n",
      "Q261\n",
      "Q261\n",
      "Q262\n",
      "Q262\n",
      "Q263\n",
      "Q263\n",
      "Q264\n",
      "Q264\n",
      "Q265\n",
      "Q265\n",
      "Q267\n",
      "Q267\n",
      "Q268\n",
      "Q268\n",
      "Q269\n",
      "Q269\n",
      "Q270\n",
      "Q270\n",
      "Q271\n",
      "Q271\n",
      "Q272\n",
      "Q272\n",
      "Q273\n",
      "Q273\n",
      "Q274\n",
      "Q274\n",
      "Q275\n",
      "Q276\n",
      "Q277\n",
      "Q277\n",
      "Q278\n",
      "Q278\n",
      "Q279\n",
      "Q279\n",
      "Q280\n",
      "Q281\n",
      "Q281\n",
      "Q282\n",
      "Q282\n",
      "Q283\n",
      "Q283\n",
      "Q284\n",
      "Q284\n",
      "Q285\n",
      "Q286\n",
      "Q286\n",
      "Q287\n",
      "Q287\n",
      "Q288\n",
      "Q288\n",
      "Q289\n",
      "Q289\n",
      "Q290\n",
      "Q290\n",
      "Q291\n",
      "Q291\n",
      "Q292\n",
      "Q292\n",
      "Q293\n",
      "Q293\n",
      "Q294\n",
      "Q294\n",
      "Q295\n",
      "Q295\n",
      "Q296\n",
      "Q296\n",
      "Q297\n",
      "Q297\n",
      "Q299\n",
      "Q299\n",
      "Q300\n",
      "Q300\n",
      "Q301\n",
      "Q301\n",
      "Q302\n",
      "Q302\n",
      "Q303\n",
      "Q303\n",
      "Q304\n",
      "Q305\n",
      "Q305\n",
      "Q306\n",
      "Q306\n",
      "Q307\n",
      "Q307\n",
      "Q308\n",
      "Q308\n",
      "Q309\n",
      "Q309\n",
      "Q310\n",
      "Q310\n",
      "Q311\n",
      "Q312\n",
      "Q312\n",
      "Q313\n",
      "Q313\n",
      "Q314\n",
      "Q314\n",
      "Q315\n",
      "Q315\n",
      "Q316\n",
      "Q316\n",
      "Q317\n",
      "Q317\n",
      "Q318\n",
      "Q318\n",
      "Q319\n",
      "Q319\n",
      "Q320\n",
      "Q320\n",
      "Q321\n",
      "Q321\n",
      "Q322\n",
      "Q322\n",
      "Q323\n",
      "Q323\n",
      "Q325\n",
      "Q325\n",
      "Q326\n",
      "Q326\n",
      "Q327\n",
      "Q327\n",
      "Q328\n",
      "Q328\n",
      "Q329\n",
      "Q329\n",
      "Q330\n",
      "Q330\n",
      "Q331\n",
      "Q331\n",
      "Q332\n",
      "Q332\n",
      "Q333\n",
      "Q333\n",
      "Q334\n",
      "Q334\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"SELECT DISTINCT ?cidoc ?inverseOf  WHERE {\n",
    "                 ?cidoc rdf:type <http://www.w3.org/2002/07/owl#ObjectProperty> ; \n",
    "                        owl:inverseOf ?inverseOf ;\n",
    "                        rdfs:range ?range .}\"\"\"\n",
    "for row in cidoc.query(query):\n",
    "    try:\n",
    "        print(qid[str(row[\"cidoc\"])])\n",
    "        localEntityEngine = wdi_core.WDItemEngine.wikibase_item_engine_factory(api,sparql)\n",
    "        statements=[]\n",
    "        statements.append(wdi_core.WDItemID(value=qid[str(row[\"inverseOf\"])], prop_nr=propertyID[\"inverse of\"]))\n",
    "        item = localEntityEngine(wd_item_id=qid[str(row[\"cidoc\"])], data=statements)\n",
    "        print(item.write(login))\n",
    "    except:\n",
    "        continue"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
