{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "bibliographic-jackson",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=N668937d8c642408e86d99f9311895884 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import rdflib\n",
    "cidoc = rdflib.Graph()\n",
    "cidoc.load(\"https://raw.githubusercontent.com/erlangen-crm/ecrm/master/ecrm_current.owl\", format=\"xml\")\n",
    "\n",
    "cidoc\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "macro-celebration",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      " ················\n"
     ]
    }
   ],
   "source": [
    "from wikidataintegrator import wdi_core, wdi_login\n",
    "from getpass import getpass\n",
    "import pandas as pd\n",
    "\n",
    "wikibase = \"https://saf1b.wiki.opencura.com/\"\n",
    "api = \"https://saf1b.wiki.opencura.com/w/api.php\"\n",
    "sparql = \"https://saf1b.wiki.opencura.com/query/sparql\"\n",
    "entityUri = wikibase.replace(\"https:\", \"http:\")+\"entity/\"\n",
    "\n",
    "WBUSER = \"Andrawaag\"\n",
    "WBPASS = getpass()\n",
    "login = wdi_login.WDLogin(WBUSER, WBPASS, mediawiki_api_url=api)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "color-distinction",
   "metadata": {},
   "outputs": [],
   "source": [
    "def createProperty(login=login, wdprop=None, lulabel=\"\", enlabel=\"\", frlabel=\"\", delabel=\"\", description=\"\", property_datatype=\"\"):\n",
    "    if wdprop== None:\n",
    "        s = []\n",
    "    else:\n",
    "        s = [wdi_core.WDUrl(wdprop, prop_nr=\"P1\")]\n",
    "    localEntityEngine = wdi_core.WDItemEngine.wikibase_item_engine_factory(api,sparql)\n",
    "    item = localEntityEngine(data=s)\n",
    "    #item.set_label(lulabel, lang=\"lu\")\n",
    "    item.set_label(enlabel, lang=\"en\")\n",
    "    item.set_label(delabel, lang=\"de\")\n",
    "    item.set_label(frlabel, lang=\"fr\")\n",
    "    item.set_description(description, lang=\"en\")\n",
    "    \n",
    "    print(item.write(login, entity_type=\"property\", property_datatype=property_datatype))\n",
    "\n",
    "datatype_map = {'http://wikiba.se/ontology#CommonsMedia': 'commonsMedia',\n",
    "                'http://wikiba.se/ontology#ExternalId': 'external-id',\n",
    "                'http://wikiba.se/ontology#GeoShape': 'geo-shape',\n",
    "                'http://wikiba.se/ontology#GlobeCoordinate': 'globe-coordinate',\n",
    "                'http://wikiba.se/ontology#Math': 'math',\n",
    "                'http://wikiba.se/ontology#Monolingualtext': 'monolingualtext',\n",
    "                'http://wikiba.se/ontology#Quantity': 'quantity',\n",
    "                'http://wikiba.se/ontology#String': 'string',\n",
    "                'http://wikiba.se/ontology#TabularData': 'tabular-data',\n",
    "                'http://wikiba.se/ontology#Time': 'time',\n",
    "                '<http://wikiba.se/ontology#Edtf>': 'edtf',\n",
    "                'http://wikiba.se/ontology#Url': 'url',\n",
    "                'http://wikiba.se/ontology#WikibaseItem': 'wikibase-item',\n",
    "                'http://wikiba.se/ontology#WikibaseProperty': 'wikibase-property'}"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "artistic-parameter",
   "metadata": {},
   "source": [
    "# predefined properties from rdfs, skos, etc"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "tracked-negotiation",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/usr/local/lib/python3.9/site-packages/wikidataintegrator/wdi_core.py:485: UserWarning: Warning: No distinct value properties found\n",
      "Please set P2302 and Q21502410 in your wikibase or set `core_props` manually.\n",
      "Continuing with no core_props\n",
      "  warnings.warn(\"Warning: No distinct value properties found\\n\" +\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "P1\n"
     ]
    }
   ],
   "source": [
    "# skos:exact match\n",
    "createProperty(login, lulabel=\"Ënnerklass vu(n)\", \n",
    "                      enlabel=\"exact match\",\n",
    "                      frlabel=\"correspondance exacte\",\n",
    "                      delabel=\"exakte Übereinstimmung\",\n",
    "                      description=\"mapping\",\n",
    "                      property_datatype=\"url\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "liable-understanding",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "P2\n"
     ]
    }
   ],
   "source": [
    "# instance of\n",
    "createProperty(login, lulabel=\"\", \n",
    "                      enlabel=\"instance of\",\n",
    "                      frlabel=\"instance de\",\n",
    "                      delabel=\"ist ein(e)\",\n",
    "                      property_datatype=\"wikibase-item\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "governmental-samoa",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "P3\n"
     ]
    }
   ],
   "source": [
    "# subclass of\n",
    "## TODO work on multilangauge descriptions \n",
    "## \n",
    "createProperty(login, lulabel=\"Ënnerklass vu(n)\", \n",
    "                      enlabel=\"subclass of\",\n",
    "                      frlabel=\"sous-classe de\",\n",
    "                      delabel=\"Unterklasse von\",\n",
    "                      property_datatype=\"wikibase-item\")\n",
    "\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "sonic-divide",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "P4\n"
     ]
    }
   ],
   "source": [
    "#domain \n",
    "createProperty(login, lulabel=\"\", \n",
    "                      enlabel=\"domain\",\n",
    "                      frlabel=\"domaine\",\n",
    "                      delabel=\"domain\",\n",
    "                      property_datatype=\"wikibase-item\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "moved-monthly",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "P5\n"
     ]
    }
   ],
   "source": [
    "#range\n",
    "createProperty(login, lulabel=\"\", \n",
    "                      enlabel=\"range\",\n",
    "                      frlabel=\"intervalle\",\n",
    "                      delabel=\"reichweite\",\n",
    "                      property_datatype=\"wikibase-item\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "palestinian-choir",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "P6\n"
     ]
    }
   ],
   "source": [
    "#subPropertyOf\n",
    "createProperty(login, lulabel=\"\", \n",
    "                      enlabel=\"subPropertyOf\",\n",
    "                      frlabel=\"sous-propriété de\",\n",
    "                      delabel=\"untereigenschaft von\",\n",
    "                      property_datatype=\"wikibase-item\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "weird-honor",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "P7\n"
     ]
    }
   ],
   "source": [
    "#inverseOf\n",
    "createProperty(login, lulabel=\"\", \n",
    "                      enlabel=\"inverse of\",\n",
    "                      frlabel=\"inverse de\",\n",
    "                      delabel=\"invers von\",\n",
    "                      property_datatype=\"wikibase-item\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "underlying-makeup",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Q1'"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# class item\n",
    "localEntityEngine = wdi_core.WDItemEngine.wikibase_item_engine_factory(api,sparql)\n",
    "item = localEntityEngine(new_item=True)\n",
    "item.set_label(\"Class\", lang=\"en\")\n",
    "item.set_aliases([\"Owl:Class\"], lang=\"en\")\n",
    "item.write(login)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "critical-vinyl",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Q2'"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# property item\n",
    "localEntityEngine = wdi_core.WDItemEngine.wikibase_item_engine_factory(api,sparql)\n",
    "item = localEntityEngine(new_item=True)\n",
    "item.set_label(\"Property\", lang=\"en\")\n",
    "item.set_aliases([\"owl:ObjectProperty\"], lang=\"en\")\n",
    "item.write(login)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "aquatic-premium",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Q3\n",
      "Q4\n",
      "Q5\n",
      "Q6\n",
      "Q7\n",
      "Q8\n",
      "Q9\n",
      "Q10\n",
      "Q11\n",
      "Q12\n",
      "Q13\n",
      "Q14\n",
      "Q15\n",
      "Q16\n",
      "Q17\n",
      "Q18\n",
      "Q19\n",
      "Q20\n",
      "Q21\n",
      "Q22\n",
      "Q23\n",
      "Q24\n",
      "Q25\n",
      "Q26\n",
      "Q27\n",
      "Q28\n",
      "Q29\n",
      "Q30\n",
      "Q31\n",
      "Q32\n",
      "Q33\n",
      "Q34\n",
      "Q35\n",
      "Q36\n",
      "Q37\n",
      "Q38\n",
      "Q39\n",
      "Q40\n",
      "Q41\n",
      "Q42\n",
      "Q43\n",
      "Q44\n",
      "Q45\n",
      "Q46\n",
      "Q47\n",
      "Q48\n",
      "Q49\n",
      "Q50\n",
      "Q51\n",
      "Q52\n",
      "Q53\n",
      "Q54\n",
      "Q55\n",
      "Q56\n",
      "Q57\n",
      "Q58\n",
      "Q59\n",
      "Q60\n",
      "Q61\n",
      "Q62\n",
      "Q63\n",
      "Q64\n",
      "Q65\n",
      "Q66\n",
      "Q67\n",
      "Q68\n",
      "Q69\n",
      "Q70\n",
      "Q71\n",
      "Q72\n",
      "Q73\n"
     ]
    }
   ],
   "source": [
    "query = \"SELECT ?cidoc ?label WHERE {?cidoc rdf:type <http://www.w3.org/2002/07/owl#Class> ; rdfs:label ?label .}\"\n",
    "for row in cidoc.query(query):\n",
    "    #print(str(row[0]), str(row[1]), \" \".join(str(row[1]).split(\" \")[1:]))\n",
    "    statements=[]\n",
    "    statements.append(wdi_core.WDItemID(value=\"Q1\", prop_nr=\"P2\"))\n",
    "    statements.append(wdi_core.WDUrl(value=str(row[0]), prop_nr=\"P1\"))\n",
    "    item = localEntityEngine(new_item=True, data=statements)\n",
    "    item.set_label(\" \".join(str(row[1]).split(\" \")), lang=\"en\")\n",
    "    #item.set_aliases([str(row[1]), str(row[1]).replace(\" \", \"_\")], lang=\"en\")\n",
    "    print(item.write(login))\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "golden-soldier",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://erlangen-crm.org/current/P104_is_subject_to P104 is subject to is subject to\n",
      "Q74\n",
      "http://erlangen-crm.org/current/P51_has_former_or_current_owner P51 has former or current owner has former or current owner\n",
      "Q75\n",
      "http://erlangen-crm.org/current/P95_has_formed P95 has formed has formed\n",
      "Q76\n",
      "http://erlangen-crm.org/current/P29i_received_custody_through P29 received custody through received custody through\n",
      "Q77\n",
      "http://erlangen-crm.org/current/P89_falls_within P89 falls within falls within\n",
      "Q78\n",
      "http://erlangen-crm.org/current/P12_occurred_in_the_presence_of P12 occurred in the presence of occurred in the presence of\n",
      "Q79\n",
      "http://erlangen-crm.org/current/P97i_was_father_for P97 was father for was father for\n",
      "Q80\n",
      "http://erlangen-crm.org/current/P69i_is_associated_with P69 is associated with is associated with\n",
      "Q81\n",
      "http://erlangen-crm.org/current/P23_transferred_title_from P23 transferred title from transferred title from\n",
      "Q82\n",
      "http://erlangen-crm.org/current/P183_ends_before_the_start_of P183 ends before the start of ends before the start of\n",
      "Q83\n",
      "http://erlangen-crm.org/current/P157_is_at_rest_relative_to P157 is at rest relative to is at rest relative to\n",
      "Error while writing to Wikidata\n",
      "ERROR: P157 is at rest relative to\n",
      "http://erlangen-crm.org/current/P5_consists_of P5 consists of consists of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P5 consists of\n",
      "http://erlangen-crm.org/current/P175_starts_before_or_with_the_start_of P175 starts before or with the start of starts before or with the start of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P175 starts before or with the start of\n",
      "http://erlangen-crm.org/current/P26_moved_to P26 moved to moved to\n",
      "Error while writing to Wikidata\n",
      "ERROR: P26 moved to\n",
      "http://erlangen-crm.org/current/P148i_is_component_of P148 is component of is component of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P148 is component of\n",
      "http://erlangen-crm.org/current/P10i_contains P10 contains contains\n",
      "Error while writing to Wikidata\n",
      "ERROR: P10 contains\n",
      "http://erlangen-crm.org/current/P59_has_section P59 has section has section\n",
      "Error while writing to Wikidata\n",
      "ERROR: P59 has section\n",
      "http://erlangen-crm.org/current/P40_observed_dimension P40 observed dimension observed dimension\n",
      "Error while writing to Wikidata\n",
      "ERROR: P40 observed dimension\n",
      "http://erlangen-crm.org/current/P126i_was_employed_in P126 was employed in was employed in\n",
      "Error while writing to Wikidata\n",
      "ERROR: P126 was employed in\n",
      "http://erlangen-crm.org/current/P150i_defines_typical_wholes_for P150 defines typical wholes for defines typical wholes for\n",
      "Error while writing to Wikidata\n",
      "ERROR: P150 defines typical wholes for\n",
      "http://erlangen-crm.org/current/P93_took_out_of_existence P93 took out of existence took out of existence\n",
      "Error while writing to Wikidata\n",
      "ERROR: P93 took out of existence\n",
      "http://erlangen-crm.org/current/P94i_was_created_by P94 was created by was created by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P94 was created by\n",
      "http://erlangen-crm.org/current/P147i_was_curated_by P147 was curated by was curated by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P147 was curated by\n",
      "http://erlangen-crm.org/current/P91_has_unit P91 has unit has unit\n",
      "Error while writing to Wikidata\n",
      "ERROR: P91 has unit\n",
      "http://erlangen-crm.org/current/P26i_was_destination_of P26 was destination of was destination of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P26 was destination of\n",
      "http://erlangen-crm.org/current/P196_defines P196 defines defines\n",
      "Error while writing to Wikidata\n",
      "ERROR: P196 defines\n",
      "http://erlangen-crm.org/current/P16i_was_used_for P16 was used for was used for\n",
      "Error while writing to Wikidata\n",
      "ERROR: P16 was used for\n",
      "http://erlangen-crm.org/current/P62_depicts P62 depicts depicts\n",
      "Error while writing to Wikidata\n",
      "ERROR: P62 depicts\n",
      "http://erlangen-crm.org/current/P102_has_title P102 has title has title\n",
      "Error while writing to Wikidata\n",
      "ERROR: P102 has title\n",
      "http://erlangen-crm.org/current/P65_shows_visual_item P65 shows visual item shows visual item\n",
      "Error while writing to Wikidata\n",
      "ERROR: P65 shows visual item\n",
      "http://erlangen-crm.org/current/P161_has_spatial_projection P161 has spatial projection has spatial projection\n",
      "Error while writing to Wikidata\n",
      "ERROR: P161 has spatial projection\n",
      "http://erlangen-crm.org/current/P41i_was_classified_by P41 was classified by was classified by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P41 was classified by\n",
      "http://erlangen-crm.org/current/P106i_forms_part_of P106 forms part of forms part of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P106 forms part of\n",
      "http://erlangen-crm.org/current/P105i_has_right_on P105 has right on has right on\n",
      "Error while writing to Wikidata\n",
      "ERROR: P105 has right on\n",
      "http://erlangen-crm.org/current/P68i_use_foreseen_by P68 use foreseen by use foreseen by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P68 use foreseen by\n",
      "http://erlangen-crm.org/current/P55_has_current_location P55 has current location has current location\n",
      "Error while writing to Wikidata\n",
      "ERROR: P55 has current location\n",
      "http://erlangen-crm.org/current/P141i_was_assigned_by P141 was assigned by was assigned by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P141 was assigned by\n",
      "http://erlangen-crm.org/current/P73i_is_translation_of P73 is translation of is translation of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P73 is translation of\n",
      "http://erlangen-crm.org/current/P133_is_spatiotemporally_separated_from P133 is separated from is separated from\n",
      "Error while writing to Wikidata\n",
      "ERROR: P133 is separated from\n",
      "http://erlangen-crm.org/current/P186i_is_produced_by P186 produced thing of product type produced thing of product type\n",
      "Error while writing to Wikidata\n",
      "ERROR: P186 produced thing of product type\n",
      "http://erlangen-crm.org/current/P21i_was_purpose_of P21 was purpose of was purpose of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P21 was purpose of\n",
      "http://erlangen-crm.org/current/P121_overlaps_with P121 overlaps with overlaps with\n",
      "Error while writing to Wikidata\n",
      "ERROR: P121 overlaps with\n",
      "http://erlangen-crm.org/current/P76i_provides_access_to P76 provides access to provides access to\n",
      "Error while writing to Wikidata\n",
      "ERROR: P76 provides access to\n",
      "http://erlangen-crm.org/current/P106_is_composed_of P106 is composed of is composed of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P106 is composed of\n",
      "http://erlangen-crm.org/current/P13_destroyed P13 destroyed destroyed\n",
      "Error while writing to Wikidata\n",
      "ERROR: P13 destroyed\n",
      "http://erlangen-crm.org/current/P19_was_intended_use_of P19 was intended use of was intended use of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P19 was intended use of\n",
      "http://erlangen-crm.org/current/P96_by_mother P96 by mother by mother\n",
      "Error while writing to Wikidata\n",
      "ERROR: P96 by mother\n",
      "http://erlangen-crm.org/current/P142i_was_used_in P142 was used in was used in\n",
      "Error while writing to Wikidata\n",
      "ERROR: P142 was used in\n",
      "http://erlangen-crm.org/current/P71i_is_listed_in P71 is listed in is listed in\n",
      "Error while writing to Wikidata\n",
      "ERROR: P71 is listed in\n",
      "http://erlangen-crm.org/current/P4i_is_time-span_of P4 is time-span of is time-span of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P4 is time-span of\n",
      "http://erlangen-crm.org/current/P50i_is_current_keeper_of P50 is current keeper of is current keeper of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P50 is current keeper of\n",
      "http://erlangen-crm.org/current/P74i_is_current_or_former_residence_of P74 is current or former residence of is current or former residence of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P74 is current or former residence of\n",
      "http://erlangen-crm.org/current/P123i_resulted_from P123 resulted from resulted from\n",
      "Error while writing to Wikidata\n",
      "ERROR: P123 resulted from\n",
      "http://erlangen-crm.org/current/P68_foresees_use_of P68 foresees use of foresees use of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P68 foresees use of\n",
      "http://erlangen-crm.org/current/P25i_moved_by P25 moved by moved by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P25 moved by\n",
      "http://erlangen-crm.org/current/P135_created_type P135 created type created type\n",
      "Error while writing to Wikidata\n",
      "ERROR: P135 created type\n",
      "http://erlangen-crm.org/current/P164_during P164 is restricted by is restricted by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P164 is restricted by\n",
      "http://erlangen-crm.org/current/P173i_ends_with_or_after_the_start_of P173 starts before or at the end of starts before or at the end of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P173 starts before or at the end of\n",
      "http://erlangen-crm.org/current/P74_has_current_or_former_residence P74 has current or former residence has current or former residence\n",
      "Error while writing to Wikidata\n",
      "ERROR: P74 has current or former residence\n",
      "http://erlangen-crm.org/current/P108i_was_produced_by P108 was produced by was produced by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P108 was produced by\n",
      "http://erlangen-crm.org/current/P50_has_current_keeper P50 has current keeper has current keeper\n",
      "Error while writing to Wikidata\n",
      "ERROR: P50 has current keeper\n",
      "http://erlangen-crm.org/current/P55i_currently_holds P55 currently holds currently holds\n",
      "Error while writing to Wikidata\n",
      "ERROR: P55 currently holds\n",
      "http://erlangen-crm.org/current/P139_has_alternative_form P139 has alternative form has alternative form\n",
      "Error while writing to Wikidata\n",
      "ERROR: P139 has alternative form\n",
      "http://erlangen-crm.org/current/P151i_participated_in P151 participated in participated in\n",
      "Error while writing to Wikidata\n",
      "ERROR: P151 participated in\n",
      "http://erlangen-crm.org/current/P135i_was_created_by P135 was created by was created by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P135 was created by\n",
      "http://erlangen-crm.org/current/P130_shows_features_of P130 shows features of shows features of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P130 shows features of\n",
      "http://erlangen-crm.org/current/P128i_is_carried_by P128 is carried by is carried by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P128 is carried by\n",
      "http://erlangen-crm.org/current/P136i_supported_type_creation P136 supported type creation supported type creation\n",
      "Error while writing to Wikidata\n",
      "ERROR: P136 supported type creation\n",
      "http://erlangen-crm.org/current/P160_has_temporal_projection P160 has temporal projection has temporal projection\n",
      "Error while writing to Wikidata\n",
      "ERROR: P160 has temporal projection\n",
      "http://erlangen-crm.org/current/P69_has_association_with P69 has association with has association with\n",
      "Error while writing to Wikidata\n",
      "ERROR: P69 has association with\n",
      "http://erlangen-crm.org/current/P11i_participated_in P11 participated in participated in\n",
      "Error while writing to Wikidata\n",
      "ERROR: P11 participated in\n",
      "http://erlangen-crm.org/current/P49i_is_former_or_current_keeper_of P49 is former or current keeper of is former or current keeper of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P49 is former or current keeper of\n",
      "http://erlangen-crm.org/current/P132_spatiotemporally_overlaps_with P132 overlaps with overlaps with\n",
      "Error while writing to Wikidata\n",
      "ERROR: P132 overlaps with\n",
      "http://erlangen-crm.org/current/P99_dissolved P99 dissolved dissolved\n",
      "Error while writing to Wikidata\n",
      "ERROR: P99 dissolved\n",
      "http://erlangen-crm.org/current/P31_has_modified P31 has modified has modified\n",
      "Error while writing to Wikidata\n",
      "ERROR: P31 has modified\n",
      "http://erlangen-crm.org/current/P1i_identifies P1 identifies identifies\n",
      "Error while writing to Wikidata\n",
      "ERROR: P1 identifies\n",
      "http://erlangen-crm.org/current/P34_concerned P34 concerned concerned\n",
      "Error while writing to Wikidata\n",
      "ERROR: P34 concerned\n",
      "http://erlangen-crm.org/current/P52i_is_current_owner_of P52 is current owner of is current owner of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P52 is current owner of\n",
      "http://erlangen-crm.org/current/P113_removed P113 removed removed\n",
      "Error while writing to Wikidata\n",
      "ERROR: P113 removed\n",
      "http://erlangen-crm.org/current/P176_starts_before_the_start_of P176 starts before the start of starts before the start of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P176 starts before the start of\n",
      "http://erlangen-crm.org/current/P49_has_former_or_current_keeper P49 has former or current keeper has former or current keeper\n",
      "Error while writing to Wikidata\n",
      "ERROR: P49 has former or current keeper\n",
      "http://erlangen-crm.org/current/P35i_was_identified_by P35 was identified by was identified by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P35 was identified by\n",
      "http://erlangen-crm.org/current/P110_augmented P110 augmented augmented\n",
      "Error while writing to Wikidata\n",
      "ERROR: P110 augmented\n",
      "http://erlangen-crm.org/current/P99i_was_dissolved_by P99 was dissolved by was dissolved by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P99 was dissolved by\n",
      "http://erlangen-crm.org/current/P20_had_specific_purpose P20 had specific purpose had specific purpose\n",
      "Error while writing to Wikidata\n",
      "ERROR: P20 had specific purpose\n",
      "http://erlangen-crm.org/current/P70i_is_documented_in P70 is documented in is documented in\n",
      "Error while writing to Wikidata\n",
      "ERROR: P70 is documented in\n",
      "http://erlangen-crm.org/current/P9_consists_of P9 consists of consists of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P9 consists of\n",
      "http://erlangen-crm.org/current/P76_has_contact_point P76 has contact point has contact point\n",
      "Error while writing to Wikidata\n",
      "ERROR: P76 has contact point\n",
      "http://erlangen-crm.org/current/P1_is_identified_by P1 is identified by is identified by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P1 is identified by\n",
      "http://erlangen-crm.org/current/P152i_is_parent_of P152 is parent of is parent of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P152 is parent of\n",
      "http://erlangen-crm.org/current/P42i_was_assigned_by P42 was assigned by was assigned by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P42 was assigned by\n",
      "http://erlangen-crm.org/current/P143i_was_joined_by P143 was joined by was joined by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P143 was joined by\n",
      "http://erlangen-crm.org/current/P44_has_condition P44 has condition has condition\n",
      "Error while writing to Wikidata\n",
      "ERROR: P44 has condition\n",
      "http://erlangen-crm.org/current/P56_bears_feature P56 bears feature bears feature\n",
      "Error while writing to Wikidata\n",
      "ERROR: P56 bears feature\n",
      "http://erlangen-crm.org/current/P137_exemplifies P137 exemplifies exemplifies\n",
      "Error while writing to Wikidata\n",
      "ERROR: P137 exemplifies\n",
      "http://erlangen-crm.org/current/P15i_influenced P15 influenced influenced\n",
      "Error while writing to Wikidata\n",
      "ERROR: P15 influenced\n",
      "http://erlangen-crm.org/current/P134_continued P134 continued continued\n",
      "Error while writing to Wikidata\n",
      "ERROR: P134 continued\n",
      "http://erlangen-crm.org/current/P40i_was_observed_in P40 was observed in was observed in\n",
      "Error while writing to Wikidata\n",
      "ERROR: P40 was observed in\n",
      "http://erlangen-crm.org/current/P48i_is_preferred_identifier_of P48 is preferred identifier of is preferred identifier of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P48 is preferred identifier of\n",
      "http://erlangen-crm.org/current/P112_diminished P112 diminished diminished\n",
      "Error while writing to Wikidata\n",
      "ERROR: P112 diminished\n",
      "http://erlangen-crm.org/current/P33i_was_used_by P33 was used by was used by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P33 was used by\n",
      "http://erlangen-crm.org/current/P52_has_current_owner P52 has current owner has current owner\n",
      "Error while writing to Wikidata\n",
      "ERROR: P52 has current owner\n",
      "http://erlangen-crm.org/current/P102i_is_title_of P102 is title of is title of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P102 is title of\n",
      "http://erlangen-crm.org/current/P157i_provides_reference_space_for P157 provides reference space for provides reference space for\n",
      "Error while writing to Wikidata\n",
      "ERROR: P157 provides reference space for\n",
      "http://erlangen-crm.org/current/P182_ends_before_or_at_the_start_of P182 ends befort or at the start of ends befort or at the start of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P182 ends befort or at the start of\n",
      "http://erlangen-crm.org/current/P142_used_constituent P142 used constituent used constituent\n",
      "Error while writing to Wikidata\n",
      "ERROR: P142 used constituent\n",
      "http://erlangen-crm.org/current/P101i_was_use_of P101 was use of was use of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P101 was use of\n",
      "http://erlangen-crm.org/current/P54_has_current_permanent_location P54 has current permanent location has current permanent location\n",
      "Error while writing to Wikidata\n",
      "ERROR: P54 has current permanent location\n",
      "http://erlangen-crm.org/current/P140i_was_attributed_by P140 was attributed by was attributed by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P140 was attributed by\n",
      "http://erlangen-crm.org/current/P23i_surrendered_title_through P23 surrendered title through surrendered title through\n",
      "Error while writing to Wikidata\n",
      "ERROR: P23 surrendered title through\n",
      "http://erlangen-crm.org/current/P112i_was_diminished_by P112 was diminished by was diminished by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P112 was diminished by\n",
      "http://erlangen-crm.org/current/P136_was_based_on P136 was based on was based on\n",
      "Error while writing to Wikidata\n",
      "ERROR: P136 was based on\n",
      "http://erlangen-crm.org/current/P138_represents P138 represents represents\n",
      "Error while writing to Wikidata\n",
      "ERROR: P138 represents\n",
      "http://erlangen-crm.org/current/P124i_was_transformed_by P124 was transformed by was transformed by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P124 was transformed by\n",
      "http://erlangen-crm.org/current/P8i_witnessed P8 witnessed witnessed\n",
      "Error while writing to Wikidata\n",
      "ERROR: P8 witnessed\n",
      "http://erlangen-crm.org/current/P94_has_created P94 has created has created\n",
      "Error while writing to Wikidata\n",
      "ERROR: P94 has created\n",
      "http://erlangen-crm.org/current/P103i_was_intention_of P103 was intention of was intention of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P103 was intention of\n",
      "http://erlangen-crm.org/current/P110i_was_augmented_by P110 was augmented by was augmented by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P110 was augmented by\n",
      "http://erlangen-crm.org/current/P138i_has_representation P138 has representation has representation\n",
      "Error while writing to Wikidata\n",
      "ERROR: P138 has representation\n",
      "http://erlangen-crm.org/current/P19i_was_made_for P19 was made for was made for\n",
      "Error while writing to Wikidata\n",
      "ERROR: P19 was made for\n",
      "http://erlangen-crm.org/current/P125_used_object_of_type P125 used object of type used object of type\n",
      "Error while writing to Wikidata\n",
      "ERROR: P125 used object of type\n",
      "http://erlangen-crm.org/current/P97_from_father P97 from father from father\n",
      "Error while writing to Wikidata\n",
      "ERROR: P97 from father\n",
      "http://erlangen-crm.org/current/P140_assigned_attribute_to P140 assigned attribute to assigned attribute to\n",
      "Error while writing to Wikidata\n",
      "ERROR: P140 assigned attribute to\n",
      "http://erlangen-crm.org/current/P144_joined_with P144 joined with joined with\n",
      "Error while writing to Wikidata\n",
      "ERROR: P144 joined with\n",
      "http://erlangen-crm.org/current/P67i_is_referred_to_by P67 is referred to by is referred to by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P67 is referred to by\n",
      "http://erlangen-crm.org/current/P46_is_composed_of P46 is composed of is composed of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P46 is composed of\n",
      "http://erlangen-crm.org/current/P184_ends_before_or_with_the_end_of P184 ens before or with the end of ens before or with the end of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P184 ens before or with the end of\n",
      "http://erlangen-crm.org/current/P104i_applies_to P104 applies to applies to\n",
      "Error while writing to Wikidata\n",
      "ERROR: P104 applies to\n",
      "http://erlangen-crm.org/current/P24_transferred_title_of P24 transferred title of transferred title of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P24 transferred title of\n",
      "http://erlangen-crm.org/current/P95i_was_formed_by P95 was formed by was formed by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P95 was formed by\n",
      "http://erlangen-crm.org/current/P22_transferred_title_to P22 transferred title to transferred title to\n",
      "Error while writing to Wikidata\n",
      "ERROR: P22 transferred title to\n",
      "http://erlangen-crm.org/current/P38i_was_deassigned_by P38 was deassigned by was deassigned by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P38 was deassigned by\n",
      "http://erlangen-crm.org/current/P100_was_death_of P100 was death of was death of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P100 was death of\n",
      "http://erlangen-crm.org/current/P67_refers_to P67 refers to refers to\n",
      "Error while writing to Wikidata\n",
      "ERROR: P67 refers to\n",
      "http://erlangen-crm.org/current/P35_has_identified P35 has identified has identified\n",
      "Error while writing to Wikidata\n",
      "ERROR: P35 has identified\n",
      "http://erlangen-crm.org/current/P188_requires_production_tool P188 requires production tool requires production tool\n",
      "Error while writing to Wikidata\n",
      "ERROR: P188 requires production tool\n",
      "http://erlangen-crm.org/current/P146_separated_from P146 separated from separated from\n",
      "Error while writing to Wikidata\n",
      "ERROR: P146 separated from\n",
      "http://erlangen-crm.org/current/P62i_is_depicted_by P62 is depicted by is depicted by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P62 is depicted by\n",
      "http://erlangen-crm.org/current/P28_custody_surrendered_by P28 custody surrendered by custody surrendered by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P28 custody surrendered by\n",
      "http://erlangen-crm.org/current/P43_has_dimension P43 has dimension has dimension\n",
      "Error while writing to Wikidata\n",
      "ERROR: P43 has dimension\n",
      "http://erlangen-crm.org/current/P109i_is_current_or_former_curator_of P109 is current or former curator of is current or former curator of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P109 is current or former curator of\n",
      "http://erlangen-crm.org/current/P146i_lost_member_by P146 lost member by lost member by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P146 lost member by\n",
      "http://erlangen-crm.org/current/P41_classified P41 classified classified\n",
      "Error while writing to Wikidata\n",
      "ERROR: P41 classified\n",
      "http://erlangen-crm.org/current/P75i_is_possessed_by P75 is possessed by is possessed by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P75 is possessed by\n",
      "http://erlangen-crm.org/current/P32i_was_technique_of P32 was technique of was technique of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P32 was technique of\n",
      "http://erlangen-crm.org/current/P147_curated P147 curated curated\n",
      "Error while writing to Wikidata\n",
      "ERROR: P147 curated\n",
      "http://erlangen-crm.org/current/P143_joined P143 joined joined\n",
      "Error while writing to Wikidata\n",
      "ERROR: P143 joined\n",
      "http://erlangen-crm.org/current/P186_produced_thing_of_product_type P186 produced thing of product type produced thing of product type\n",
      "Error while writing to Wikidata\n",
      "ERROR: P186 produced thing of product type\n",
      "http://erlangen-crm.org/current/P70_documents P70 documents documents\n",
      "Error while writing to Wikidata\n",
      "ERROR: P70 documents\n",
      "http://erlangen-crm.org/current/P45i_is_incorporated_in P45 is incorporated in is incorporated in\n",
      "Error while writing to Wikidata\n",
      "ERROR: P45 is incorporated in\n",
      "http://erlangen-crm.org/current/P150_defines_typical_parts_of P150 defines typical parts of defines typical parts of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P150 defines typical parts of\n",
      "http://erlangen-crm.org/current/P15_was_influenced_by P15 was influenced by was influenced by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P15 was influenced by\n",
      "http://erlangen-crm.org/current/P25_moved P25 moved moved\n",
      "Error while writing to Wikidata\n",
      "ERROR: P25 moved\n",
      "http://erlangen-crm.org/current/P29_custody_received_by P29 custody received by custody received by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P29 custody received by\n",
      "http://erlangen-crm.org/current/P127_has_broader_term P127 has broader term has broader term\n",
      "Error while writing to Wikidata\n",
      "ERROR: P127 has broader term\n",
      "http://erlangen-crm.org/current/P4_has_time-span P4 has time-span has time-span\n",
      "Error while writing to Wikidata\n",
      "ERROR: P4 has time-span\n",
      "http://erlangen-crm.org/current/P53i_is_former_or_current_location_of P53 is former or current location of is former or current location of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P53 is former or current location of\n",
      "http://erlangen-crm.org/current/P22i_acquired_title_through P22 acquired title through acquired title through\n",
      "Error while writing to Wikidata\n",
      "ERROR: P22 acquired title through\n",
      "http://erlangen-crm.org/current/P144i_gained_member_by P144 gained member by gained member by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P144 gained member by\n",
      "http://erlangen-crm.org/current/P100i_died_in P100 died in died in\n",
      "Error while writing to Wikidata\n",
      "ERROR: P100 died in\n",
      "http://erlangen-crm.org/current/P8_took_place_on_or_within P8 took place on or within took place on or within\n",
      "Error while writing to Wikidata\n",
      "ERROR: P8 took place on or within\n",
      "http://erlangen-crm.org/current/P151_was_formed_from P151 was formed from was formed from\n",
      "Error while writing to Wikidata\n",
      "ERROR: P151 was formed from\n",
      "http://erlangen-crm.org/current/P27i_was_origin_of P27 was origin of was origin of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P27 was origin of\n",
      "http://erlangen-crm.org/current/P122_borders_with P122 borders with borders with\n",
      "Error while writing to Wikidata\n",
      "ERROR: P122 borders with\n",
      "http://erlangen-crm.org/current/P187_has_production_plan P187 has production plan has production plan\n",
      "Error while writing to Wikidata\n",
      "ERROR: P187 has production plan\n",
      "http://erlangen-crm.org/current/P92_brought_into_existence P92 brought into existence brought into existence\n",
      "Error while writing to Wikidata\n",
      "ERROR: P92 brought into existence\n",
      "http://erlangen-crm.org/current/P44i_is_condition_of P44 is condition of is condition of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P44 is condition of\n",
      "http://erlangen-crm.org/current/P2_has_type P2 has type has type\n",
      "Error while writing to Wikidata\n",
      "ERROR: P2 has type\n",
      "http://erlangen-crm.org/current/P11_had_participant P11 had participant had participant\n",
      "Error while writing to Wikidata\n",
      "ERROR: P11 had participant\n",
      "http://erlangen-crm.org/current/P72i_is_language_of P72 is language of is language of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P72 is language of\n",
      "http://erlangen-crm.org/current/P27_moved_from P27 moved from moved from\n",
      "Error while writing to Wikidata\n",
      "ERROR: P27 moved from\n",
      "http://erlangen-crm.org/current/P38_deassigned P38 deassigned deassigned\n",
      "Error while writing to Wikidata\n",
      "ERROR: P38 deassigned\n",
      "http://erlangen-crm.org/current/P107_has_current_or_former_member P107 has current or former member has current or former member\n",
      "Error while writing to Wikidata\n",
      "ERROR: P107 has current or former member\n",
      "http://erlangen-crm.org/current/P53_has_former_or_current_location P53 has former or current location has former or current location\n",
      "Error while writing to Wikidata\n",
      "ERROR: P53 has former or current location\n",
      "http://erlangen-crm.org/current/P7i_witnessed P7 witnessed witnessed\n",
      "Error while writing to Wikidata\n",
      "ERROR: P7 witnessed\n",
      "http://erlangen-crm.org/current/P34i_was_assessed_by P34 was assessed by was assessed by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P34 was assessed by\n",
      "http://erlangen-crm.org/current/P59i_is_located_on_or_within P59 is located on or within is located on or within\n",
      "Error while writing to Wikidata\n",
      "ERROR: P59 is located on or within\n",
      "http://erlangen-crm.org/current/P177_assigned_property_type P177 assigned property type assigned property type\n",
      "Error while writing to Wikidata\n",
      "ERROR: P177 assigned property type\n",
      "http://erlangen-crm.org/current/P127i_has_narrower_term P127 has narrower term has narrower term\n",
      "Error while writing to Wikidata\n",
      "ERROR: P127 has narrower term\n",
      "http://erlangen-crm.org/current/P89i_contains P89 contains contains\n",
      "Error while writing to Wikidata\n",
      "ERROR: P89 contains\n",
      "http://erlangen-crm.org/current/P152_has_parent P152 has parent has parent\n",
      "Error while writing to Wikidata\n",
      "ERROR: P152 has parent\n",
      "http://erlangen-crm.org/current/P108_has_produced P108 has produced has produced\n",
      "Error while writing to Wikidata\n",
      "ERROR: P108 has produced\n",
      "http://erlangen-crm.org/current/P86_falls_within P86 falls within falls within\n",
      "Error while writing to Wikidata\n",
      "ERROR: P86 falls within\n",
      "http://erlangen-crm.org/current/P148_has_component P148 has component has component\n",
      "Error while writing to Wikidata\n",
      "ERROR: P148 has component\n",
      "http://erlangen-crm.org/current/P130i_features_are_also_found_on P130 features are also found on features are also found on\n",
      "Error while writing to Wikidata\n",
      "ERROR: P130 features are also found on\n",
      "http://erlangen-crm.org/current/P180_has_currency P180 has currency has currency\n",
      "Error while writing to Wikidata\n",
      "ERROR: P180 has currency\n",
      "http://erlangen-crm.org/current/P173_starts_before_or_at_the_end_of P173 starts before or at the end of starts before or at the end of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P173 starts before or at the end of\n",
      "http://erlangen-crm.org/current/P145_separated P145 separated separated\n",
      "Error while writing to Wikidata\n",
      "ERROR: P145 separated\n",
      "http://erlangen-crm.org/current/P91i_is_unit_of P91 is unit of is unit of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P91 is unit of\n",
      "http://erlangen-crm.org/current/P195_was_presence_of P195 was presence of was presence of\n",
      "Error while writing to Wikidata\n",
      "ERROR: P195 was presence of\n",
      "http://erlangen-crm.org/current/P129_is_about P129 is about is about\n",
      "Error while writing to Wikidata\n",
      "ERROR: P129 is about\n",
      "http://erlangen-crm.org/current/P145i_left_by P145 left by left by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P145 left by\n",
      "http://erlangen-crm.org/current/P17_was_motivated_by P17 was motivated by was motivated by\n",
      "Error while writing to Wikidata\n",
      "ERROR: P17 was motivated by\n",
      "http://erlangen-crm.org/current/P72_has_language P72 has language has language\n",
      "Q84\n",
      "http://erlangen-crm.org/current/P73_has_translation P73 has translation has translation\n",
      "Q85\n",
      "http://erlangen-crm.org/current/P42_assigned P42 assigned assigned\n",
      "Q86\n",
      "http://erlangen-crm.org/current/P113i_was_removed_by P113 was removed by was removed by\n",
      "Q87\n",
      "http://erlangen-crm.org/current/P21_had_general_purpose P21 had general purpose had general purpose\n",
      "Q88\n",
      "http://erlangen-crm.org/current/P86i_contains P86 contains contains\n",
      "Q89\n",
      "http://erlangen-crm.org/current/P56i_is_found_on P56 is found on is found on\n",
      "Q90\n",
      "http://erlangen-crm.org/current/P30_transferred_custody_of P30 transferred custody of transferred custody of\n",
      "Q91\n",
      "http://erlangen-crm.org/current/P16_used_specific_object P16 used specific object used specific object\n",
      "Q92\n",
      "http://erlangen-crm.org/current/P31i_was_modified_by P31 was modified by was modified by\n",
      "Q93\n",
      "http://erlangen-crm.org/current/P92i_was_brought_into_existence_by P92 was brought into existence by was brought into existence by\n",
      "Q94\n",
      "http://erlangen-crm.org/current/P96i_gave_birth P96 gave birth gave birth\n",
      "Q95\n",
      "http://erlangen-crm.org/current/P20i_was_purpose_of P20 was purpose of was purpose of\n",
      "Q96\n",
      "http://erlangen-crm.org/current/P129i_is_subject_of P129 is subject of is subject of\n",
      "Q97\n",
      "http://erlangen-crm.org/current/P123_resulted_in P123 resulted in resulted in\n",
      "Q98\n",
      "http://erlangen-crm.org/current/P14i_performed P14 performed performed\n",
      "Q99\n",
      "http://erlangen-crm.org/current/P5i_forms_part_of P5 forms part of forms part of\n",
      "Q100\n",
      "http://erlangen-crm.org/current/P43i_is_dimension_of P43 is dimension of is dimension of\n",
      "Q101\n",
      "http://erlangen-crm.org/current/P51i_is_former_or_current_owner_of P51 is former or current owner of is former or current owner of\n",
      "Q102\n",
      "http://erlangen-crm.org/current/P174_starts_before_the_end_of P174 starts before the end of starts before the end of\n",
      "Q103\n",
      "http://erlangen-crm.org/current/P2i_is_type_of P2 is type of is type of\n",
      "Q104\n",
      "http://erlangen-crm.org/current/P109_has_current_or_former_curator P109 has current or former curator has current or former curator\n",
      "Q105\n",
      "http://erlangen-crm.org/current/P98i_was_born P98 was born was born\n",
      "Q106\n",
      "http://erlangen-crm.org/current/P179_had_sales_price P179 had sales price had sales price\n",
      "Q107\n",
      "http://erlangen-crm.org/current/P185i_ends_after_the_end_of  \n",
      "Q108\n",
      "http://erlangen-crm.org/current/P174i_ends_after_the_start_of P174 ends after the start of ends after the start of\n",
      "Q109\n",
      "http://erlangen-crm.org/current/P156_occupies P156 occupies occupies\n",
      "Q110\n",
      "http://erlangen-crm.org/current/P13i_was_destroyed_by P13 was destroyed by was destroyed by\n",
      "Q111\n",
      "http://erlangen-crm.org/current/P184i_ends_with_or_after_the_end_of P184 ends before or with the end of ends before or with the end of\n",
      "Q112\n",
      "http://erlangen-crm.org/current/P128_carries P128 carries carries\n",
      "Q113\n",
      "http://erlangen-crm.org/current/P30i_custody_transferred_through P30 custody transferred through custody transferred through\n",
      "Q114\n",
      "http://erlangen-crm.org/current/P124_transformed P124 transformed transformed\n",
      "Q115\n",
      "http://erlangen-crm.org/current/P48_has_preferred_identifier P48 has preferred identifier has preferred identifier\n",
      "Q116\n",
      "http://erlangen-crm.org/current/P111i_was_added_by P111 was added by was added by\n",
      "Q117\n",
      "http://erlangen-crm.org/current/P185_ends_before_the_end_of P185 ends before the end of ends before the end of\n",
      "Q118\n",
      "http://erlangen-crm.org/current/P24i_changed_ownership_through P24 changed ownership through changed ownership through\n",
      "Q119\n",
      "http://erlangen-crm.org/current/P191_had_duration P191 had duration had duration\n",
      "Q120\n",
      "http://erlangen-crm.org/current/P111_added P111 added added\n",
      "Q121\n",
      "http://erlangen-crm.org/current/P39_measured P39 measured measured\n",
      "Q122\n",
      "http://erlangen-crm.org/current/P33_used_specific_technique P33 used specific technique used specific technique\n",
      "Q123\n",
      "http://erlangen-crm.org/current/P46i_forms_part_of P46 forms part of forms part of\n",
      "Q124\n",
      "http://erlangen-crm.org/current/P126_employed P126 employed employed\n",
      "Q125\n",
      "http://erlangen-crm.org/current/P7_took_place_at P7 took place at took place at\n",
      "Q126\n",
      "http://erlangen-crm.org/current/P54i_is_current_permanent_location_of P54 is current permanent location of is current permanent location of\n",
      "Q127\n",
      "http://erlangen-crm.org/current/P65i_is_shown_by P65 is shown by is shown by\n",
      "Q128\n",
      "http://erlangen-crm.org/current/P14_carried_out_by P14 carried out by carried out by\n",
      "Q129\n",
      "http://erlangen-crm.org/current/P45_consists_of P45 consists of consists of\n",
      "Q130\n",
      "http://erlangen-crm.org/current/P17i_motivated P17 motivated motivated\n",
      "Q131\n",
      "http://erlangen-crm.org/current/P189_approximates P189 approximates approximates\n",
      "Q132\n",
      "http://erlangen-crm.org/current/P134i_was_continued_by P134 was continued by was continued by\n",
      "Q133\n",
      "http://erlangen-crm.org/current/P32_used_general_technique P32 used general technique used general technique\n",
      "Q134\n",
      "http://erlangen-crm.org/current/P37_assigned P37 assigned assigned\n",
      "Q135\n",
      "http://erlangen-crm.org/current/P141_assigned P141 assigned assigned\n",
      "Q136\n",
      "http://erlangen-crm.org/current/P10_falls_within P10 falls within falls within\n",
      "Q137\n",
      "http://erlangen-crm.org/current/P107i_is_current_or_former_member_of P107 is current or former member of is current or former member of\n",
      "Q138\n",
      "http://erlangen-crm.org/current/P93i_was_taken_out_of_existence_by P93 was taken out of existence by was taken out of existence by\n",
      "Q139\n",
      "http://erlangen-crm.org/current/P75_possesses P75 possesses possesses\n",
      "Q140\n",
      "http://erlangen-crm.org/current/P71_lists P71 lists lists\n",
      "Q141\n",
      "http://erlangen-crm.org/current/P103_was_intended_for P103 was intended for was intended for\n",
      "Q142\n",
      "http://erlangen-crm.org/current/P12i_was_present_at P12 was present at was present at\n",
      "Q143\n",
      "http://erlangen-crm.org/current/P125i_was_type_of_object_used_in P125 was type of object used in was type of object used in\n",
      "Q144\n",
      "http://erlangen-crm.org/current/P28i_surrendered_custody_through P28 surrendered custody through surrendered custody through\n",
      "Q145\n",
      "http://erlangen-crm.org/current/P105_right_held_by P105 right held by right held by\n",
      "Q146\n",
      "http://erlangen-crm.org/current/P137i_is_exemplified_by P137 is exemplified by is exemplified by\n",
      "Q147\n",
      "http://erlangen-crm.org/current/P39i_was_measured_by P39 was measured by was measured by\n",
      "Q148\n",
      "http://erlangen-crm.org/current/P9i_forms_part_of P9 forms part of forms part of\n",
      "Q149\n",
      "http://erlangen-crm.org/current/P37i_was_assigned_by P37 was assigned by was assigned by\n",
      "Q150\n",
      "http://erlangen-crm.org/current/P101_had_as_general_use P101 had as general use had as general use\n",
      "Q151\n",
      "http://erlangen-crm.org/current/P98_brought_into_life P98 brought into life brought into life\n",
      "Q152\n"
     ]
    }
   ],
   "source": [
    "#propertyClasses\n",
    "query = \"SELECT ?cidoc ?label WHERE {?cidoc rdf:type <http://www.w3.org/2002/07/owl#ObjectProperty> ; rdfs:label ?label .}\"\n",
    "for row in cidoc.query(query):\n",
    "    print(str(row[0]), str(row[1]), \" \".join(str(row[1]).split(\" \")[1:]))\n",
    "    statements=[]\n",
    "    statements.append(wdi_core.WDItemID(value=\"Q2\", prop_nr=\"P2\"))\n",
    "    statements.append(wdi_core.WDUrl(value=str(row[0]), prop_nr=\"P1\"))\n",
    "    item = localEntityEngine(new_item=True, data=statements)\n",
    "    item.set_label(\" \".join(str(row[1]).split(\" \")), lang=\"en\")\n",
    "    #item.set_aliases([str(row[1]), str(row[1]).replace(\" \", \"_\")], lang=\"en\")\n",
    "    try:\n",
    "        print(item.write(login))\n",
    "    except:\n",
    "        print(\"ERROR: \"+str(row[1]))\n",
    "        continue"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "developmental-document",
   "metadata": {},
   "outputs": [],
   "source": [
    "qid = dict()\n",
    "query = \"PREFIX wdt: <http://safcidoc2.wiki.opencura.com/prop/direct/> SELECT * WHERE {?item wdt:P1 ?uri .}\"\n",
    "for index, row in wdi_core.WDItemEngine.execute_sparql_query(query, as_dataframe = True, endpoint=sparql).iterrows():\n",
    "    qid[row[\"uri\"]] =row[\"item\"].replace(\"http://safcidoc2.wiki.opencura.com/entity/\", \"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "civilian-turkey",
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "import traceback\n",
    "query = \"\"\"SELECT DISTINCT ?cidoc ?domain  WHERE {\n",
    "                 ?cidoc rdf:type <http://www.w3.org/2002/07/owl#ObjectProperty> ; \n",
    "                        rdfs:domain ?domain .}\"\"\"\n",
    "for row in cidoc.query(query):\n",
    "    try:\n",
    "        print(qid[str(row[\"cidoc\"])].replace(\"http://safcidoc2.wiki.opencura.com/entity/\", \"\"))\n",
    "        localEntityEngine = wdi_core.WDItemEngine.wikibase_item_engine_factory(api,sparql)\n",
    "        statements=[]\n",
    "        statements.append(wdi_core.WDItemID(value=qid[str(row[\"domain\"])].replace(\"http://safcidoc2.wiki.opencura.com/entity/\", \"\"), prop_nr=\"P4\"))\n",
    "        item = localEntityEngine(wd_item_id=qid[str(row[\"cidoc\"])].replace(\"http://safcidoc2.wiki.opencura.com/entity/\", \"\"), data=statements)\n",
    "        print(item.write(login))\n",
    "    except Exception as e:\n",
    "        print(traceback.format_exc())\n",
    "        continue\n",
    "\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "charitable-roommate",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"SELECT DISTINCT ?cidoc ?range  WHERE {\n",
    "                 ?cidoc rdf:type <http://www.w3.org/2002/07/owl#ObjectProperty> ; \n",
    "                        rdfs:range ?range .}\"\"\"\n",
    "for row in cidoc.query(query):\n",
    "    try:\n",
    "        print(qid[str(row[\"cidoc\"])])\n",
    "        localEntityEngine = wdi_core.WDItemEngine.wikibase_item_engine_factory(api,sparql)\n",
    "        statements=[]\n",
    "        statements.append(wdi_core.WDItemID(value=qid[str(row[\"range\"])].replace(\"http://safcidoc2.wiki.opencura.com/entity/\", \"\"), prop_nr=\"P5\"))\n",
    "        item = localEntityEngine(wd_item_id=qid[str(row[\"cidoc\"])].replace(\"http://safcidoc2.wiki.opencura.com/entity/\", \"\"), data=statements)\n",
    "        print(item.write(login))\n",
    "    except:\n",
    "        str(row[\"cidoc\"])\n",
    "        continue"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "authentic-difficulty",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"SELECT DISTINCT ?cidoc ?subPropertyOf  WHERE {\n",
    "                 ?cidoc rdf:type <http://www.w3.org/2002/07/owl#ObjectProperty> ; \n",
    "                        rdfs:subPropertyOf ?subPropertyOf ;\n",
    "                        rdfs:range ?range .}\"\"\"\n",
    "for row in cidoc.query(query):\n",
    "    try:\n",
    "        print(qid[str(row[\"cidoc\"])])\n",
    "        localEntityEngine = wdi_core.WDItemEngine.wikibase_item_engine_factory(api,sparql)\n",
    "        statements=[]\n",
    "        statements.append(wdi_core.WDItemID(value=qid[str(row[\"subPropertyOf\"])], prop_nr=\"P6\"))\n",
    "        item = localEntityEngine(wd_item_id=qid[str(row[\"cidoc\"])], data=statements)\n",
    "        print(item.write(login))\n",
    "    except:\n",
    "        continue"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "hundred-sailing",
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"SELECT DISTINCT ?cidoc ?inverseOf  WHERE {\n",
    "                 ?cidoc rdf:type <http://www.w3.org/2002/07/owl#ObjectProperty> ; \n",
    "                        owl:inverseOf ?inverseOf ;\n",
    "                        rdfs:range ?range .}\"\"\"\n",
    "for row in cidoc.query(query):\n",
    "    try:\n",
    "        print(qid[str(row[\"cidoc\"])])\n",
    "        localEntityEngine = wdi_core.WDItemEngine.wikibase_item_engine_factory(api,sparql)\n",
    "        statements=[]\n",
    "        statements.append(wdi_core.WDItemID(value=qid[str(row[\"inverseOf\"])], prop_nr=\"P7\"))\n",
    "        item = localEntityEngine(wd_item_id=qid[str(row[\"cidoc\"])], data=statements)\n",
    "        print(item.write(login))\n",
    "    except:\n",
    "        continue"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "integral-peninsula",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.0"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
